/*
 Navicat Premium Data Transfer

 Source Server         : 阿里云-任务系统
 Source Server Type    : MySQL
 Source Server Version : 80045
 Source Host           : 118.31.165.121:3306
 Source Schema         : task_manage

 Target Server Type    : MySQL
 Target Server Version : 80045
 File Encoding         : 65001

 Date: 17/05/2026 11:28:30
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for department
-- ----------------------------
DROP TABLE IF EXISTS `department`;
CREATE TABLE `department`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '科室ID',
  `name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '科室名称',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `tid`(`tid`) USING BTREE,
  CONSTRAINT `department_ibfk_1` FOREIGN KEY (`tid`) REFERENCES `tenant` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of department
-- ----------------------------
INSERT INTO `department` VALUES ('1a510726-c06e-4441-b7be-4c7115061b0f', '成教', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `department` VALUES ('1d3271a4-f27b-4d35-8f2e-a69f6856218b', '系统管理中心', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `department` VALUES ('addeec73-f911-11f0-b532-6018953679ef', '研办', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `department` VALUES ('b23da0d1-f911-11f0-b532-6018953679ef', '学工办', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `department` VALUES ('b61d2b17-f911-11f0-b532-6018953679ef', '院办', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `department` VALUES ('ba2213e4-f911-11f0-b532-6018953679ef', '教务办', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `department` VALUES ('bf43c504-f911-11f0-b532-6018953679ef', '院领导', '8a09e425-f911-11f0-b532-6018953679ef');

-- ----------------------------
-- Table structure for meeting
-- ----------------------------
DROP TABLE IF EXISTS `meeting`;
CREATE TABLE `meeting`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '主键ID',
  `meeting_type` varchar(2) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '0' COMMENT '会议类型：0-单日会议，1-多日会议',
  `start_week` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '起始星期（如：星期一）',
  `end_week` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '结束星期（多日必填）',
  `start_date` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '起始日期（如：2026-03-16）',
  `end_date` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '结束日期（多日必填）',
  `start_start_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '起始日开始时间(hh:mm)',
  `end_end_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '结束日结束时间(hh:mm)',
  `status` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '未开始' COMMENT '会议状态',
  `meeting_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '会议名称',
  `host` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '主持人',
  `participants` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '参加对象',
  `location` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '会议地点',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  `uid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '会议创建人',
  `create_time` datetime(0) NOT NULL DEFAULT CURRENT_TIMESTAMP(0) COMMENT '创建时间',
  `update_time` datetime(0) NOT NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0) COMMENT '更新时间',
  `isdelete` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '0' COMMENT '逻辑删除：0-未删除，1-已删除',
  `isshow` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '1' COMMENT '展示大屏：0-否，1-是',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `idx_date`(`start_date`, `end_date`) USING BTREE COMMENT '日期索引'
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '学校会议安排表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of meeting
-- ----------------------------
INSERT INTO `meeting` VALUES ('0d0332b9-9160-47e2-83e3-302ae4b4775a', '0', '星期二', NULL, '2026-05-12', NULL, '上午08:30', '上午10:30', '63c2229c-315f-11f1-999c-6018953679ef', '学院班子会议', '郦炬', '学院领导班子成员', '17-408', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 13:35:37', '2026-05-14 13:36:50', '0', '1');
INSERT INTO `meeting` VALUES ('1', '0', '星期一', NULL, '2026-03-16', NULL, '上午09:30', '上午09:30', '63c2229c-315f-11f1-999c-6018953679ef', '浙江师范大学第二届校友创新创业大赛暨金华市创新创业大赛复赛开幕式', '贾日恒', '浙师大金华科创园相关参赛及工作人员', '浙师大金华科创园会议中心（3号楼）', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:40', '1', '1');
INSERT INTO `meeting` VALUES ('10', '0', '星期五', NULL, '2026-03-20', NULL, '上午08:30', '上午08:30', '63c2229c-315f-11f1-999c-6018953679ef', '校党委理论学习中心组学习会', '蒋云良', '校党委理论学习中心组成员，数学学院、非洲研究院党委领导班子成员', '行政中心多功能会议室', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:25', '1', '1');
INSERT INTO `meeting` VALUES ('11', '0', '星期五', NULL, '2026-03-20', NULL, '下午16:00', '下午18:00', '63c2229c-315f-11f1-999c-6018953679ef', '言十座谈会', '郑忠龙', '校领导（蒋书记）、学院班子成员、言十专家', '正阳中心3号楼102会议室', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:23', '1', '1');
INSERT INTO `meeting` VALUES ('11c0b445-1d38-4e4a-9278-448269d973b4', '0', '星期二', NULL, '2026-04-14', NULL, '上午07:54', '上午07:54', '63c2229c-315f-11f1-999c-6018953679ef', '学院班子会', '郦炬', '学院班子成员', '17-408', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:18', '1', '1');
INSERT INTO `meeting` VALUES ('12', '0', '星期五', NULL, '2026-03-20', NULL, '上午00:00', '下午23:59', '63c2229c-315f-11f1-999c-6018953679ef', '中层干部集中轮训', NULL, '全体中层干部（含参照管理、学术副职）（学院班子成员）', '行政中心报告厅', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:21', '1', '1');
INSERT INTO `meeting` VALUES ('13', '0', '星期六', NULL, '2026-03-21', NULL, '上午09:00', '上午09:00', '63c2229c-315f-11f1-999c-6018953679ef', '2026言十论坛', '郑忠龙', '校领导（林校长）、学院班子成员、学院中层干部、言十专家', '正阳中心3号楼102会议室', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:20', '1', '1');
INSERT INTO `meeting` VALUES ('1a18255f-0574-4f4e-8558-ed43527e0b8b', '0', '星期二', NULL, '2026-04-14', NULL, '上午08:54', '上午08:54', '63c2229c-315f-11f1-999c-6018953679ef', '浙师大服务“人工智能+文化旅游”应用试点申报工作座谈会', '未知', '全员', '设计学院（18幢教学楼二楼会议室）', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:16', '1', '1');
INSERT INTO `meeting` VALUES ('1c9ad50c-29d9-4dc3-b549-4d59bd90a2c4', '1', '星期二', '星期五', '2026-05-12', '2026-05-15', '上午10:02', '下午12:02', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '123', '李', '23', '1232', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-12 10:03:51', '2026-05-12 19:51:53', '1', '1');
INSERT INTO `meeting` VALUES ('2', '0', '星期一', NULL, '2026-03-16', NULL, '上午11:00', '上午11:00', '63c2229c-315f-11f1-999c-6018953679ef', '实验室安全研判现场会', '贾日恒、周水红', '实验室安全管理相关人员', '32幢朱信忠实验室', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:38', '1', '1');
INSERT INTO `meeting` VALUES ('2a6302b9-1c45-4401-9b43-ecdf973aa4f6', '0', '星期五', NULL, '2026-04-17', NULL, '下午13:54', '下午13:54', '63c2229c-315f-11f1-999c-6018953679ef', '兼职教授聘任仪式', '郦炬', '校友代表、教师代表', '17-401', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:04', '1', '1');
INSERT INTO `meeting` VALUES ('3', '0', '星期二', NULL, '2026-03-17', NULL, '上午08:30', '上午08:30', '63c2229c-315f-11f1-999c-6018953679ef', '学院班子会', '郦炬', '学院班子成员', '17-408', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:37', '1', '1');
INSERT INTO `meeting` VALUES ('38fb118d-f4ee-4432-909b-fc3577768f15', '0', '星期四', NULL, '2026-04-16', NULL, '上午10:24', '上午10:24', '63c2229c-315f-11f1-999c-6018953679ef', '浙江师范大学教师教育馆、校史博物馆开馆仪式，校志（2016-2026）发布会、《郑晓沧著译集》发布会', '邱利民', '校党政领导班子成员，各学院、部门（单位）相关负责人，校友、师生代表', '教师教育馆、校史博物馆', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:06', '1', '1');
INSERT INTO `meeting` VALUES ('3c0a33d8-614e-4b88-8b8a-7a04a6389ba1', '0', '星期六', NULL, '2026-04-18', NULL, '上午09:54', '上午09:54', '63c2229c-315f-11f1-999c-6018953679ef', '浙江师范大学建校 70 周年高质量发展大会', '蒋云良', '校党政领导班子成员，老领导代表，中层干部代表，高层次人才、民主党派和统战团体负责人代表，校友、社会各界朋友、老教师、在校师生代表', '图文信息中心报告厅', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:41:42', '1', '1');
INSERT INTO `meeting` VALUES ('3d84a02c-9961-45b9-ac48-ac4c49a7df2a', '0', '星期五', NULL, '2026-05-15', NULL, '下午13:54', '下午15:54', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', 'CCF CV走进高校系列活动', '郑忠龙', 'CCF CV专家、校领导、学院师生', '正阳中心\n2号楼报告厅', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:43:04', '2026-05-14 12:43:12', '1', '1');
INSERT INTO `meeting` VALUES ('4', '0', '星期二', NULL, '2026-03-17', NULL, '下午14:00', '下午14:00', '63c2229c-315f-11f1-999c-6018953679ef', '2026年校硕士研究生复试录取工作会议', '张建珍', '研究生院、纪检监察室相关负责人，各研究生招生学院院长（郑忠龙）、分管副院长（周昌军）、纪委书记（纪检委员）（潘向、贾日恒、胡兆龙）、研办主任（戴倩）、研究生秘书（高贵芳）', '行政中心报告厅', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:35', '1', '1');
INSERT INTO `meeting` VALUES ('40671d97-51ce-4893-8bd6-9a7d89fc43da', '0', '星期二', NULL, '2026-04-14', NULL, '下午14:54', '下午14:54', '63c2229c-315f-11f1-999c-6018953679ef', '校本科教学工作例会', '李  盛', '学生处、教务处、终身学院、创业中心相关负责人，各学院分管教学副院长（贾日恒）、教务办主任（李慧秋）', '行政北楼302 会议室', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:15', '1', '1');
INSERT INTO `meeting` VALUES ('46894b1f-2242-44d6-b704-c62d0c757fdf', '0', '星期二', NULL, '2026-05-12', NULL, '上午08:24', '上午10:24', '63c2229c-315f-11f1-999c-6018953679ef', '学院班子会议', '郦炬', '学院领导班子成员', '17-408', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:25:45', '2026-05-14 12:43:35', '1', '1');
INSERT INTO `meeting` VALUES ('4835c11b-b978-48b1-af5c-43b53d626194', '0', '星期三', NULL, '2026-05-13', NULL, '下午13:00', '下午15:00', '63c2229c-315f-11f1-999c-6018953679ef', '校长办公会议', '邱利民', '校长、分管学生工作校党委副书记、副校长', '行政南楼\n302会议室', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 13:35:37', '2026-05-14 13:36:39', '0', '1');
INSERT INTO `meeting` VALUES ('5', '0', '星期二', NULL, '2026-03-17', NULL, '下午15:00', '下午15:00', '63c2229c-315f-11f1-999c-6018953679ef', '两地办学协调会', '张建珍', '郑忠龙、郦炬', '行政南楼302会议室', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:33', '1', '1');
INSERT INTO `meeting` VALUES ('54db90e0-891d-449e-94fa-a82e6c590064', '0', '星期四', NULL, '2026-05-14', NULL, '下午14:24', '下午16:24', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '校党委会议', '蒋云良', '校党委委员', '行政南楼\n202会议室', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:25:45', '2026-05-14 12:43:27', '1', '1');
INSERT INTO `meeting` VALUES ('57c8d185-2ca5-462d-82a9-d4b241e2dc82', '0', '星期四', NULL, '2026-05-14', NULL, '上午10:24', '下午12:24', '00beb639-79af-4999-b1de-318956734974', '经济责任审计进点会', NULL, '校党政班子成员，各部门（单位）主要负责人（郑忠龙），\n各二级党组织书记（郦炬）', '正阳中心\n2号楼报告厅', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:25:45', '2026-05-14 12:43:26', '1', '1');
INSERT INTO `meeting` VALUES ('597ca295-d8d9-41f7-845b-82bfbdb216f1', '0', '星期二', NULL, '2026-05-12', NULL, '上午08:24', '上午10:24', '63c2229c-315f-11f1-999c-6018953679ef', '学院班子会议', '郦炬', '学院领导班子成员', '17-408', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:43:04', '2026-05-14 12:43:32', '1', '1');
INSERT INTO `meeting` VALUES ('5d99262b-5b7c-4c58-a4df-68d742e79226', '0', '星期三', NULL, '2026-04-15', NULL, '上午08:54', '上午08:54', '63c2229c-315f-11f1-999c-6018953679ef', '四中挂牌签订协议 ', '未知', '郦炬、郑忠龙', '金华四中', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:13', '1', '1');
INSERT INTO `meeting` VALUES ('5df395ed-6f43-4bce-9254-fb65e273352c', '0', '星期六', NULL, '2026-04-18', NULL, '下午13:54', '下午13:54', '63c2229c-315f-11f1-999c-6018953679ef', '浙里院长论坛', '郑忠龙', '省内部分高校院长、CCF各分部代表、企业家代表等', '万达嘉华酒店', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:41:34', '1', '1');
INSERT INTO `meeting` VALUES ('6', '0', '星期三', NULL, '2026-03-18', NULL, '上午09:00', '上午09:00', '63c2229c-315f-11f1-999c-6018953679ef', '校意识形态工作培训会暨“总体国家安全教育进校园”宣讲', '吕迎春', '校安全稳定工作专班成员，各二级党组织书记（郦炬）、各学院副书记（潘向）、学工办主任（程璐）、院办主任（陈慧），全体辅导员', '行政中心报告厅', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:32', '1', '1');
INSERT INTO `meeting` VALUES ('6f0d3dda-69a2-4095-9187-b3f39cd8982e', '0', '星期五', NULL, '2026-05-15', NULL, '下午13:00', '下午15:00', '63c2229c-315f-11f1-999c-6018953679ef', 'CCF CV走进高校系列活动', '郑忠龙', 'CCF CV专家、校领导、学院师生', '正阳中心\n2号楼报告厅', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 13:35:37', '2026-05-17 10:20:34', '0', '1');
INSERT INTO `meeting` VALUES ('7', '0', '星期三', NULL, '2026-03-18', NULL, '下午14:30', '下午14:30', '63c2229c-315f-11f1-999c-6018953679ef', '全省高校学习贯彻党的二十届四中全会精神轮训示范班开班仪式', '蒋云良', '全体中层干部（含参照管理、学术副职）（学院班子成员）', '行政中心报告厅', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:30', '1', '1');
INSERT INTO `meeting` VALUES ('7743a4d9-e81e-4088-b27d-a5f1dc1fe8d4', '0', '星期一', NULL, '2026-04-27', NULL, '上午00:00', '下午23:59', '00beb639-79af-4999-b1de-318956734974', '今日会议测试', '123', '123', '123', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-04-27 22:08:48', '2026-04-29 16:02:19', '1', '1');
INSERT INTO `meeting` VALUES ('798f9e4f-cb9c-4fd7-a464-cabc39641baa', '0', '星期四', NULL, '2026-05-14', NULL, '下午12:28', '下午14:28', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '213', '21321', '31231', '31231', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:28:59', '2026-05-14 12:43:21', '1', '1');
INSERT INTO `meeting` VALUES ('7ef375c3-001f-441f-9d81-240bd7bb6be4', '0', '星期三', NULL, '2026-04-15', NULL, '上午09:24', '上午09:24', '63c2229c-315f-11f1-999c-6018953679ef', '校党委会议', '蒋云良', '校党委委员', '行政南楼202 会议室', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:11', '1', '1');
INSERT INTO `meeting` VALUES ('8', '0', '星期四', NULL, '2026-03-19', NULL, '上午09:00', '上午09:00', '63c2229c-315f-11f1-999c-6018953679ef', '校高层次人才引进工作领导小组会议', '林一钢', '校高层次人才引进工作领导小组成员', '行政南楼202会议室', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:28', '1', '1');
INSERT INTO `meeting` VALUES ('8186877c-3365-4bb3-9236-49eb14df1ac3', '0', '星期三', NULL, '2026-04-15', NULL, '上午08:24', '上午08:24', '63c2229c-315f-11f1-999c-6018953679ef', '校党委理论学习中心组学习会', '蒋云良', '校党委理论学习中心组成员，经济与管理学院、国际文化与社会发展学院党委领导班子成员', '行政中心多功能会议室', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:09', '1', '1');
INSERT INTO `meeting` VALUES ('841d76b7-337f-4aa8-97e8-0e2036e259fb', '0', '星期三', NULL, '2026-05-13', NULL, '下午13:54', '下午15:54', '63c2229c-315f-11f1-999c-6018953679ef', '校长办公会议', '邱利民', '校长、分管学生工作校党委副书记、副校长', '行政南楼\n302会议室', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:25:45', '2026-05-14 12:43:30', '1', '1');
INSERT INTO `meeting` VALUES ('8dda28e8-c9a9-43c5-9714-c03723071d74', '0', '星期三', NULL, '2026-05-13', NULL, '下午13:54', '下午15:54', '63c2229c-315f-11f1-999c-6018953679ef', '校长办公会议', '邱利民', '校长、分管学生工作校党委副书记、副校长', '行政南楼\n302会议室', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:43:04', '2026-05-14 12:43:29', '1', '1');
INSERT INTO `meeting` VALUES ('9', '0', '星期四', NULL, '2026-03-19', NULL, '上午00:00', '下午23:59', '63c2229c-315f-11f1-999c-6018953679ef', '中层干部集中轮训', NULL, '全体中层干部（含参照管理、学术副职）（学院班子成员）', '行政中心报告厅', '8a09e425-f911-11f0-b532-6018953679ef', '2025009', '2026-03-15 00:00:00', '2026-05-14 11:42:27', '1', '1');
INSERT INTO `meeting` VALUES ('9796906f-39ce-4545-bdae-ec549405d35d', '1', '星期五', '星期二', '2026-05-08', '2026-05-12', '下午20:27', '下午22:27', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '测试', '123', '123', '123', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-08 20:27:28', '2026-05-08 20:27:42', '1', '1');
INSERT INTO `meeting` VALUES ('a69c98f3-b4b1-4d23-8965-6f1f23bcb458', '0', '星期四', NULL, '2026-05-14', NULL, '下午14:24', '下午16:24', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '校党委会议', '蒋云良', '校党委委员', '行政南楼\n202会议室', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:43:04', '2026-05-14 12:43:20', '1', '1');
INSERT INTO `meeting` VALUES ('c026bf3e-6099-4f83-a5f9-25dace4b5c5d', '1', '星期一', '星期四', '2026-04-27', '2026-04-30', '上午00:00', '下午23:59', '63c2229c-315f-11f1-999c-6018953679ef', '多日会议测试', '123', '123', '123', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-04-27 21:59:30', '2026-04-27 22:03:46', '1', '1');
INSERT INTO `meeting` VALUES ('c6880be8-f8e3-4790-b8e1-7e6bb91b5104', '1', '星期六', '星期四', '2026-04-25', '2026-04-30', '上午09:15', '下午19:15', '00beb639-79af-4999-b1de-318956734974', '多日会议所有项都需要填写', '选填项', '必填项', '必填项', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 14:57:40', '2026-05-14 14:57:48', '1', '1');
INSERT INTO `meeting` VALUES ('d2b07fc1-8971-4354-a8b1-6312aa1a6cae', '0', '星期四', NULL, '2026-05-14', NULL, '下午12:46', '下午14:46', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '213', '', '1231', '123', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:46:39', '2026-05-14 13:35:31', '1', '1');
INSERT INTO `meeting` VALUES ('d6806c21-92aa-45e0-b101-f288afc83f0a', '0', '星期五', NULL, '2026-04-17', NULL, '上午08:24', '上午08:24', '63c2229c-315f-11f1-999c-6018953679ef', '校高层次人才引进工作领导小组会议', '林一钢', '校高层次人才引进工作领导小组成员', '行政南楼202 会议室', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:41:43', '1', '1');
INSERT INTO `meeting` VALUES ('d6bffca5-c003-44da-b77d-368fc7290d1f', '0', '星期日', NULL, '2026-04-19', NULL, '上午08:54', '上午08:54', '63c2229c-315f-11f1-999c-6018953679ef', 'ACM集训队校友返校座谈会暨捐赠仪式', '未知', 'ACM集训队校友、在校学生等', '正阳3号楼202会议室', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:41:37', '1', '1');
INSERT INTO `meeting` VALUES ('d76404df-8447-45ed-9c5b-f089983a62cd', '0', '星期四', NULL, '2026-05-14', NULL, '下午14:30', '下午16:30', '63c2229c-315f-11f1-999c-6018953679ef', '校党委会议', '蒋云良', '校党委委员', '行政南楼\n202会议室', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 13:35:37', '2026-05-14 23:27:52', '0', '1');
INSERT INTO `meeting` VALUES ('db666df9-2aeb-4306-a7b6-1bb82a1318dd', '0', '星期四', NULL, '2026-05-14', NULL, '上午10:24', '下午12:24', '00beb639-79af-4999-b1de-318956734974', '经济责任审计进点会', NULL, '校党政班子成员，各部门（单位）主要负责人（郑忠龙），\n各二级党组织书记（郦炬）', '正阳中心\n2号楼报告厅', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:43:04', '2026-05-14 12:43:13', '1', '1');
INSERT INTO `meeting` VALUES ('e4c2d696-91d3-41ce-a43a-7ef9acf7d00e', '0', '星期三', NULL, '2026-04-15', NULL, '上午09:54', '上午09:54', '63c2229c-315f-11f1-999c-6018953679ef', '千万师生同上一堂国家安全教育课', '吕迎春', '校安全稳定工作专班成员单位负责人，各二级党组织保卫委员（周昌军）、平安校园建设工作联络员（陈慧），各学院安全工作辅导员（袁壮），全体保卫干部，班主任、实验员、学生代表', '大学生活动中心二楼报告厅', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:42:07', '1', '1');
INSERT INTO `meeting` VALUES ('ef951a20-a097-44e8-8093-49c43a36621b', '0', '星期六', NULL, '2026-04-25', NULL, '上午08:30', '上午10:30', '00beb639-79af-4999-b1de-318956734974', '单日会议不用填写结束日期', '选填项', '必填项', '必填项', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 14:57:40', '2026-05-14 14:57:50', '1', '1');
INSERT INTO `meeting` VALUES ('f8974204-9b9d-48a4-aa38-47cb41ab0d35', '0', '星期五', NULL, '2026-05-15', NULL, '下午13:54', '下午15:54', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', 'CCF CV走进高校系列活动', '郑忠龙', 'CCF CV专家、校领导、学院师生', '正阳中心\n2号楼报告厅', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 12:25:45', '2026-05-14 12:43:10', '1', '1');
INSERT INTO `meeting` VALUES ('fa253a35-f9cf-46f9-bf8e-153162e048a9', '0', '星期六', NULL, '2026-04-18', NULL, '下午18:54', '下午18:54', '63c2229c-315f-11f1-999c-6018953679ef', '浙江师范大学建校 70 周年办学成果展演', '未知', '全员', '音乐厅', '8a09e425-f911-11f0-b532-6018953679ef', '20184369', '2026-04-13 16:36:45', '2026-05-14 11:41:40', '1', '1');
INSERT INTO `meeting` VALUES ('fc659a3d-4afb-47b3-b45a-efb024d22822', '0', '星期四', NULL, '2026-05-14', NULL, '上午10:30', '下午12:30', '63c2229c-315f-11f1-999c-6018953679ef', '经济责任审计进点会', NULL, '校党政班子成员，各部门（单位）主要负责人（郑忠龙），\n各二级党组织书记（郦炬）', '正阳中心\n2号楼报告厅', '8a09e425-f911-11f0-b532-6018953679ef', 'admin', '2026-05-14 13:35:37', '2026-05-14 23:27:46', '0', '1');

-- ----------------------------
-- Table structure for plan
-- ----------------------------
DROP TABLE IF EXISTS `plan`;
CREATE TABLE `plan`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务ID',
  `name` varchar(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务名称',
  `detail` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '任务详情',
  `attribute` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务性质sys_dic.name',
  `start_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '开始时间',
  `end_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '结束时间',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学院ID',
  `did` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '科室ID',
  `uid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '申报人ID',
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务类型sys_dic.name',
  `head` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '负责人',
  `imp` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '重要程度sys_dic.name',
  `status` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务状态sys_dic.name',
  `achievement` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '任务成果',
  `create_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'yyyy-MM-dd HH:mm:ss 格式\r\n',
  `update_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'yyyy-MM-dd HH:mm:ss 格式',
  `isdelete` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '逻辑删除',
  `isopen` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '可见范围',
  `isshow` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '是否展示到驾驶舱',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `uid`(`uid`) USING BTREE,
  INDEX `type_id`(`type`) USING BTREE,
  CONSTRAINT `plan_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of plan
-- ----------------------------
INSERT INTO `plan` VALUES ('001da3fd-3c65-4ba5-8e20-be88ac989a51', '11', '11', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-03-28', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '7c7c0103-1f21-4c8e-8056-4584cfa7584e', '11', '常规', '2872cf06-b955-4120-a6c9-03232e4cd01d', '11', '2026-03-27 10:26:25', '2026-03-27 10:26:25', '0', '1', '1');
INSERT INTO `plan` VALUES ('00bc8902-06b4-42e4-bbab-821c6b835244', '评优评奖', '计算各类数据，评比荣誉称号', '0fde0037-edf8-11f0-8623-6018953679ef', '2025-07-01', '2025-11-30', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '袁壮、楼奕', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '奖项公示', '2026-02-05 20:57:07', '2026-03-14 21:28:16', '0', '1', '1');
INSERT INTO `plan` VALUES ('0373f44d-893c-4254-8b0f-ec928b99a617', '班主任工作成果', '梳理班主任工作成果', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-03-24', '2026-03-25', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', '10e9a69e-4e6b-4966-837f-df87d541db86', '程璐', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-03-24 15:49:18', '2026-04-02 10:33:01', '0', '1', '1');
INSERT INTO `plan` VALUES ('0393afac-d3bf-4c62-a2a4-cdfb49422a82', '2025年中国高校产学研创新基金－新一代信息技术创新项目申请指南', '未来网络；轨道交通；新一代信息系统；虚拟现实；人工智能；智能制造；智慧教育；网络空间安全；云计算与数据安全；高校信息化研究；数字教育。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-24', '2026-06-20', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-24 15:35:41', '2026-04-24 15:35:41', '0', '1', '1');
INSERT INTO `plan` VALUES ('03becb56-790e-4027-9e61-b6f959129236', '测试数据2', '测试数据2', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-01-01', '2026-02-28', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2025002', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张三', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试数据2', '2026-03-28 12:35:13', '2026-04-02 10:31:15', '1', '1', '1');
INSERT INTO `plan` VALUES ('03c71641-d68d-452d-8a9c-eb60cfc5a98f', '2026年留学生综合素质评价', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-14', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', '84a082fb-5930-4785-9375-2bdcc8d1bda0', '隋傅、彭景云', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-22 09:46:26', '2026-05-09 08:44:09', '0', '1', '1');
INSERT INTO `plan` VALUES ('04cc17f4-ae73-479d-95b5-cf8eb5326253', '程璐-测试', '测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-03-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '20204622', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '程璐', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试', '2026-03-27 21:19:03', '2026-03-27 21:21:53', '1', '1', '1');
INSERT INTO `plan` VALUES ('06b0b5f4-8a66-4706-8a45-ebcf39765931', '2026年公开出版教材统计', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-07', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-10 11:01:54', '2026-04-23 15:39:54', '0', '1', '1');
INSERT INTO `plan` VALUES ('074f5060-723e-4b3b-9ded-27213f2cf04a', '学工办-党建思政建测试', '学工办-党建思政建测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-25', '2026-03-26', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '2025004', '10e9a69e-4e6b-4966-837f-df87d541db86', '张利娟', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '学工办-党建思政建测试', '2026-03-25 16:06:03', '2026-03-27 21:22:00', '1', '1', '1');
INSERT INTO `plan` VALUES ('07b22c11-1228-405c-a210-8c9523a5d7e5', '2026年转专业、初阳选拔', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-05', '2026-04-19', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 14:19:24', '2026-04-09 14:19:24', '0', '1', '1');
INSERT INTO `plan` VALUES ('09f32fd3-63d3-47a1-9773-1b3493b7f981', '测试数据1', '测试数据1', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-01', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2025002', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张三', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试数据1', '2026-03-28 12:35:13', '2026-04-02 10:31:17', '1', '1', '1');
INSERT INTO `plan` VALUES ('0aee09ab-86fc-4502-8252-c24d85d863e0', '党员发展', '按年度完成党员发展指标', '0fde0037-edf8-11f0-8623-6018953679ef', '2025-01-01', '2025-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张利娟', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '党员发展材料', '2026-02-05 20:57:07', '2026-02-05 20:57:07', '0', '1', '1');
INSERT INTO `plan` VALUES ('0b525ffb-ab66-445f-b89d-f489ae6dc2e1', '测试数据5', '测试数据5', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-09-01', '2026-10-31', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2025002', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张三', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试数据4', '2026-03-28 12:35:13', '2026-04-02 10:31:19', '1', '1', '1');
INSERT INTO `plan` VALUES ('0bbc7bb5-3eff-464d-a27d-05be8baf792a', '关于开展 2026 年“科学家精神教育基地” 申报工作的通知', '（1）申报条件：①申报主体主要包括科技馆、重大科技工程纪念馆（遗迹）、科研机构和科创平台（企业）、科技人物纪念馆（故旧居）等。②有独立的展馆，或相对独立的展厅和展览空间。③展馆（展厅）的主要内容，必须是以宣传讲述科学家或创新团队、科研群体爱国创新、求实奉献、协同育人的故事和精神为主，不是单纯的科学技术普及、青少年科学培训或者科研成就和装备的展览展示。④有一定数量的珍贵实物，包括书信、手稿、图纸、证章、照片、历史影像等。⑤有比较规范的管理制度和讲解团队。⑥经常性面向社会公众特别是青少年开放，组织各类科学家⑦精神宣传教育活动，开发制作适于传播的宣传产品。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-10', '2026-04-15', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-13 11:12:15', '2026-04-15 08:23:43', '0', '1', '1');
INSERT INTO `plan` VALUES ('0fd46cce-f64c-4890-8aa8-d1125a3c7465', '20252学期初阳警示', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-17', '2026-04-27', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 14:20:23', '2026-04-09 14:20:23', '0', '1', '1');
INSERT INTO `plan` VALUES ('1162d136-f637-493e-84c4-c1494c2095dc', '2232', '23411', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-01-01', '2026-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '2025004', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '李星云', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '13213321', '2026-03-21 21:18:44', '2026-03-25 16:03:59', '1', '1', '1');
INSERT INTO `plan` VALUES ('118f2b9a-3fb6-445b-ad4c-df731ac41e5e', '11', '1111', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-03-27', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '84a082fb-5930-4785-9375-2bdcc8d1bda0', '111', '常规', '2872cf06-b955-4120-a6c9-03232e4cd01d', '444', '2026-03-27 10:39:03', '2026-03-27 10:39:03', '0', '1', '1');
INSERT INTO `plan` VALUES ('12c73e03-bfcf-4e12-9af3-331db4dbd030', '测试', '测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-28', '2026-04-28', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '20184369', 'aa1e7031-19c5-4367-84c6-7d4bc144f1d5', '陈慧', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试', '2026-04-28 08:20:22', '2026-04-29 16:03:36', '1', '1', '0');
INSERT INTO `plan` VALUES ('14d74f52-4d18-44ea-9a9e-99fff1ca9e5f', '浙江省高等院校计算机类优秀教学案例评选', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-11', '2026-05-24', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-27 14:43:06', '2026-04-27 14:43:06', '0', '1', '1');
INSERT INTO `plan` VALUES ('1a7c44cf-b3c7-4665-97da-47ea93a3dcb2', '2026年度教育部大中小学课程教材研究项目申报', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-20', '2026-05-05', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-20 17:04:32', '2026-05-07 08:26:14', '0', '1', '1');
INSERT INTO `plan` VALUES ('2644b71e-c45c-40cd-a473-fc4ff95967a7', '2026届论文答辩稿提交', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-09', '2026-04-15', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021390', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '何煜', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 15:44:46', '2026-04-15 10:29:37', '0', '1', '1');
INSERT INTO `plan` VALUES ('26816d12-e227-4c6c-a761-fbd590142215', '2026年博士招生', '4月25日博士考生英语水平测试，我院6人参加；4月30日前完成博士考生材料评分；5月上旬--中旬博士考生面试。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-13', '2026-05-31', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'a757bbbd-b6ac-4be9-ae37-09f1c865b0aa', '高贵芳', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-15 11:06:26', '2026-04-29 09:18:08', '0', '1', '1');
INSERT INTO `plan` VALUES ('26c59942-da53-4ff5-a86d-e0ecdc1f86be', '关于组织申报2027年度金华市科技计划项目的通知', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-30', '2026-05-13', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 11:30:19', '2026-04-09 11:38:27', '0', '1', '1');
INSERT INTO `plan` VALUES ('282aa75c-5856-4068-a112-0cbbe969fbb0', '111', '111', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-03-27', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '84a082fb-5930-4785-9375-2bdcc8d1bda0', '11', '常规', '2872cf06-b955-4120-a6c9-03232e4cd01d', '111', '2026-03-27 10:15:49', '2026-03-27 10:15:49', '0', '1', '1');
INSERT INTO `plan` VALUES ('29af4dc6-006d-4e2c-bb8a-fe032654a8df', '111', '222', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-19', '2026-03-26', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '111', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '', '2026-03-19 11:31:38', '2026-03-19 11:33:30', '1', '0', '1');
INSERT INTO `plan` VALUES ('29fc84c7-d7f0-4de2-9f13-468b5029bc9c', '2026年夏季预毕业国际本科生 信息核对工作', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-14', '2026-05-22', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅、李魏', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-14 10:45:53', '2026-04-14 11:21:29', '0', '1', '1');
INSERT INTO `plan` VALUES ('2a6cf3bc-49ab-4a0d-aa7a-d50ea0b7aa71', '测试数据4', '测试数据4', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-07-01', '2026-08-30', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2025002', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张三', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试数据4', '2026-03-28 12:35:13', '2026-04-02 10:31:21', '1', '1', '1');
INSERT INTO `plan` VALUES ('2b20dcea-1c03-4f8b-bfce-b09346303704', '20252学期课程档案检查', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-07', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 14:22:42', '2026-05-11 08:35:44', '0', '1', '1');
INSERT INTO `plan` VALUES ('2bf75d15-fd14-439a-ad54-511982b4fc1e', '20252留学生退学预警', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-07', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021469', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李魏、彭景云', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 15:54:37', '2026-05-06 09:58:31', '0', '1', '1');
INSERT INTO `plan` VALUES ('2f9f10d8-0518-4411-84b2-b709c308465f', '毕业生科研成果审核', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-01', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '7c7c0103-1f21-4c8e-8056-4584cfa7584e', '付慧娟', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-15 10:30:46', '2026-04-15 11:03:30', '0', '1', '1');
INSERT INTO `plan` VALUES ('3253f199-0bf2-4a8a-83c9-2d37d5757659', '学工办-党建思政建测试2', '学工办-党建思政建测试2', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-25', '2026-03-26', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '2025004', '10e9a69e-4e6b-4966-837f-df87d541db86', '张利娟', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-03-25 16:10:43', '2026-03-27 21:21:58', '1', '1', '1');
INSERT INTO `plan` VALUES ('352c3a74-a6db-4ea6-8cdf-4882696e99f7', '2232', '23411', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-01-01', '2026-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '2025004', 'a757bbbd-b6ac-4be9-ae37-09f1c865b0aa', '李星云', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '13213321', '2026-03-21 21:19:23', '2026-03-25 16:03:57', '1', '1', '1');
INSERT INTO `plan` VALUES ('3ceb33db-0812-4802-b705-a720828d4736', '资助工作', '资助对象认定及助学金发放', '0fde0037-edf8-11f0-8623-6018953679ef', '2025-01-01', '2025-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张芸', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '资助认定、资助审核', '2026-02-05 20:57:07', '2026-04-09 11:32:30', '0', '1', '1');
INSERT INTO `plan` VALUES ('3f358877-4b51-4df2-8e1f-dcc6e76cc4dc', '金华市科学技术局 关于开展2026年度市“科技副总”推荐工作的通知', '请有意向的老师于2026年5月15日前主动对接企业，由企业完成推荐上报，并填写《备案表》发研办；2025年已派驻的科技副总，协议在有效期内的仍需由企业重新填报信息。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-02', '2026-05-15', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 11:32:43', '2026-04-09 11:32:43', '0', '1', '1');
INSERT INTO `plan` VALUES ('3fd2f17f-f308-4a52-95b0-7a9e3fe2e3b7', '2026年双创工作结题和申报', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-09', '2026-05-13', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:42:50', '2026-05-09 08:44:23', '0', '1', '1');
INSERT INTO `plan` VALUES ('40bb66bf-c6c8-4f25-aefd-4244aea88d46', '2026年高校星火馆科学营（常态营）活动组织实施项目', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-14', '2026-05-20', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-14 09:06:32', '2026-05-14 09:06:32', '0', '1', '1');
INSERT INTO `plan` VALUES ('422e8fb9-089b-4905-93aa-c03ded35e2e3', '11', '11', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-03-28', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '7c7c0103-1f21-4c8e-8056-4584cfa7584e', '11', '常规', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '11', '2026-03-27 10:25:55', '2026-03-27 10:25:55', '0', '1', '1');
INSERT INTO `plan` VALUES ('43db3cf5-4835-4d78-9830-ef94f2cdd173', '任务测试', '任务测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-02-05', '2026-02-28', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '2025004', '753d0eee-08ce-483d-9034-3531b173ea3d', '任务测试', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '任务测试', '2026-02-05 21:05:24', '2026-02-05 21:05:38', '1', '0', '1');
INSERT INTO `plan` VALUES ('44755139-1ec3-4536-9fe2-f02c8e278d9b', '浙江师范大学关于征集2026年度科研助理岗位需求计划的通知', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-15', '2026-05-21', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-15 08:41:11', '2026-05-15 08:41:11', '0', '1', '1');
INSERT INTO `plan` VALUES ('48630dbd-6fab-4d13-8c07-fe23f49d8e68', '导入测试', '导入测试', '0fde0037-edf8-11f0-8623-6018953679ef', '7447-11-19', '7447-11-19', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '导入测试', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', NULL, '2026-03-24 11:09:32', '2026-03-25 16:03:55', '1', '1', '1');
INSERT INTO `plan` VALUES ('4bc8c62f-f544-411d-8edc-9d303f9dfb01', '2026年研究生复试', '测试测试测试测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-28', '2026-03-29', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '戴情、高贵芳', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-03-25 09:22:41', '2026-04-15 10:29:49', '0', '1', '1');
INSERT INTO `plan` VALUES ('4dbc3e63-5fc9-4152-918f-4b6ee68d75c4', '关于组织申报2026年度高等教育研究课题暨“人工智能赋能教育教学应用研究”专项课题立项申报工作的通知', '（1）2026年度高等教育研究课题申报办法：我校限报5项。\n（2）“人工智能赋能教育教学应用研究”专项课题申报办法：我校限报2项。\n提交学院排序时间：4月20日', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-17', '2026-04-20', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-03-25 14:36:42', '2026-04-21 08:39:39', '0', '1', '1');
INSERT INTO `plan` VALUES ('4df6afbb-8237-4168-98a1-d463e3074b66', '【任期目标】国家三大科技奖 力争+1', '【任期目标】国家三大科技奖 力争+1', '0fde0037-edf8-11f0-8623-6018953679ef', '2023-01-01', '2026-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '20184369', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '谷昊洋', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '稳步增加', '2026-04-30 14:35:11', '2026-04-30 14:35:15', '1', '1', '0');
INSERT INTO `plan` VALUES ('50e2a790-830b-43a2-942c-8d1fcbcf0c72', '微专业申报', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-03-20', '2026-04-20', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:50:32', '2026-04-23 15:36:59', '0', '1', '1');
INSERT INTO `plan` VALUES ('52e28895-c82d-4bd7-9254-72fea9e633c2', '期中考试以及前半程课程期末考试安排', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-21', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021469', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李魏', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-05-06 10:11:13', '2026-05-06 10:11:13', '0', '1', '1');
INSERT INTO `plan` VALUES ('5454f32f-680c-43d2-98db-eb340d5a2c97', '关于开展2026年著作定级申报工作的通知', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-08', '2026-05-30', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-08 16:12:31', '2026-05-08 16:12:31', '0', '1', '1');
INSERT INTO `plan` VALUES ('54956ed8-e4f3-46cb-819b-d44ee0da9661', '省高教学会课题申报', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-03-11', '2026-04-10', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:52:05', '2026-04-09 11:52:05', '0', '1', '1');
INSERT INTO `plan` VALUES ('5c5f2ec3-171f-4d9e-997d-561751575453', '3月25日', '3月25日', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-25', '2026-03-26', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'ad853781-eeb4-44da-9d25-29b1083168c3', '戴情', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '3月25日', '2026-03-25 16:01:34', '2026-03-25 16:03:46', '1', '1', '1');
INSERT INTO `plan` VALUES ('602bd286-cdd8-4857-92d5-5b3f0267f56f', '实习三方协议提交', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-09', '2026-05-31', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021390', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '何煜', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 15:53:40', '2026-04-09 15:53:40', '0', '1', '1');
INSERT INTO `plan` VALUES ('6038d5e7-2841-408a-bd85-b01a7cfc5b87', '20252学期退学警示', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-06', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:44:04', '2026-05-09 08:44:17', '0', '1', '1');
INSERT INTO `plan` VALUES ('615899f8-edbf-4982-9134-c6e4463ead07', '导入测试', '导入测试导入测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-24', '2026-03-24', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '导入测试', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '导入测试', '2026-03-24 11:10:19', '2026-03-25 16:03:53', '1', '1', '0');
INSERT INTO `plan` VALUES ('616af84e-c450-4e86-8c20-8faa2a95d1df', '就业工作', '联系学生推荐岗位，录入就业材料', '0fde0037-edf8-11f0-8623-6018953679ef', '2025-09-01', '2028-02-05', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'a757bbbd-b6ac-4be9-ae37-09f1c865b0aa', '杨卓、楼奕', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '就业率', '2026-02-05 20:57:07', '2026-03-26 22:26:58', '0', '1', '1');
INSERT INTO `plan` VALUES ('6546371c-836a-41c5-af32-97a2020f6cbb', '2232', '23411', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-01-01', '2026-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', 'admin', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '李星云', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '13213321', '2026-03-21 21:11:53', '2026-03-25 16:04:04', '1', '1', '1');
INSERT INTO `plan` VALUES ('683cddb9-0e86-4eeb-b552-210b2bd9b3ff', '测试数据3', '测试数据3', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-01', '2026-06-30', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2025002', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张三', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试数据3', '2026-03-28 12:35:13', '2026-04-02 10:31:23', '1', '1', '1');
INSERT INTO `plan` VALUES ('6ac8e6ff-9a1a-45ad-b3e8-fe5a25a2bc80', '测试数据6', '测试数据6', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-11-01', '2026-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2025002', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张三', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试数据4', '2026-03-28 12:35:13', '2026-04-02 10:31:13', '1', '0', '1');
INSERT INTO `plan` VALUES ('6b8783cc-ab1c-414f-94ff-226da97fa402', '20252调停课维护审核', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-05', '2026-06-24', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021469', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李魏', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-10 11:07:48', '2026-04-13 11:01:39', '0', '1', '1');
INSERT INTO `plan` VALUES ('724aa9ec-f51d-4381-869b-619b6a87f60c', '学科竞赛集中授课课时统计', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-03', '2026-04-10', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 15:41:54', '2026-04-13 08:27:35', '0', '1', '1');
INSERT INTO `plan` VALUES ('72b86317-973e-4d15-8567-7adff4f24938', '学科竞赛', '打磨竞赛项目', '0fde0037-edf8-11f0-8623-6018953679ef', '2025-01-01', '2025-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张志琪', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '竞赛奖项', '2026-02-05 20:57:07', '2026-02-11 17:07:57', '1', '1', '1');
INSERT INTO `plan` VALUES ('73a61833-7829-406e-a20c-e5d57125d297', '测试', '测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-01-01', '2026-01-01', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '测试', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试', '2026-04-16 09:31:08', '2026-04-16 09:31:40', '1', '1', '1');
INSERT INTO `plan` VALUES ('767c8710-b697-4c4f-9e72-dd50ae226c8b', '2026年计算机学院夏季毕业生学位评定委员会', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-09', '2026-05-18', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-09 08:45:49', '2026-05-09 08:45:49', '0', '1', '1');
INSERT INTO `plan` VALUES ('796f7b87-23f9-41e6-a6ac-b9b43ef666b0', '省级课程思政教学案例征集', '学院截止时间4月10日', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-03', '2026-04-15', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:47:08', '2026-04-16 11:56:05', '0', '1', '1');
INSERT INTO `plan` VALUES ('7de5dc97-ef71-4daa-9239-c3d8b2d7416e', '学工办-党建思政建测试3', '学工办-党建思政建测试3', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-25', '2026-03-26', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '20204622', '10e9a69e-4e6b-4966-837f-df87d541db86', '程璐', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '学工办-党建思政建测试3', '2026-03-25 16:19:08', '2026-03-27 21:21:56', '1', '1', '1');
INSERT INTO `plan` VALUES ('7e46eacd-083a-464a-8bf7-a4c1463ca9d9', '中国高校产学研创新基金-具身智能机器人创新教育专项申请指南', '新质生产力背景下AI人工智能与具身智能深度融合应用研究；新质生产力背景下具身智能机器人工业场景应用研究；新质生产力背景下服务机器人多场景智能应用研究；新质生产力背景下农业机器人智慧种植技术研究；新质生产力背景下医疗健康机器人智慧康养服务研究；新质生产力背景下具身智能机器人在其他领域的研究等。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-24', '2026-05-30', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-24 15:34:58', '2026-04-24 15:34:58', '0', '1', '1');
INSERT INTO `plan` VALUES ('82a82b11-8a1f-43c1-953c-e4d4f8967a60', '2026届学位论文盲审', '安排并监管过程', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-15', '2026-05-01', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '付慧娟', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '盲审评阅书', '2026-02-05 20:57:07', '2026-02-11 17:07:54', '1', '1', '1');
INSERT INTO `plan` VALUES ('83935052-47ad-444e-96b1-6e82bcd4cc2e', '国家自然科学基金优秀青年科学基金项目（海外）项目指南', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-10', '2026-06-15', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 11:29:03', '2026-04-09 11:29:03', '0', '1', '1');
INSERT INTO `plan` VALUES ('8a4b94eb-fba8-45f0-8e87-ec710ddb0821', '浙江师范大学科学技术处关于开展 2026年校级科学技术奖申报工作的通知', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-29', '2026-05-20', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-29 09:07:56', '2026-05-05 21:46:18', '0', '1', '1');
INSERT INTO `plan` VALUES ('8c58ed19-f345-47ca-b735-fee320e61c4a', '关于公布学校2026年第一季度授权专利需盘点清单的通知', '10个专利需建档', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-08', '2026-04-20', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:35:46', '2026-04-21 08:39:47', '0', '1', '1');
INSERT INTO `plan` VALUES ('8d520bbc-49e5-441f-a123-7259d6c4a355', '明智讲堂系列学术报告（滕尚华 南加州大学 教授）', '报告题目：Understanding and Characterizing Regularization\n报告人：滕尚华\n报告时间：2026年3月27日 上午10:00\n报告地点：20幢1楼报告厅', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-03-27', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-03-25 14:48:51', '2026-04-07 11:45:51', '0', '1', '1');
INSERT INTO `plan` VALUES ('8f4dd4a0-7e03-4470-822d-59cb5c5a258a', '教师教学业绩考核办法修订', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-25', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-20 10:21:55', '2026-05-08 10:50:43', '0', '1', '1');
INSERT INTO `plan` VALUES ('944e83d6-97a8-4f22-a558-b3430f12ca3d', '科技部国际合作司关于发布国家重点研发计划“政府间国际科技创新合作”重点专项2026年度第二批联合研发项目申报指南的通知', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-07', '2026-06-18', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-06 08:21:32', '2026-05-06 08:21:32', '0', '1', '1');
INSERT INTO `plan` VALUES ('9462eb6f-caee-4168-8f9b-c021668c4071', '金华市督学推荐', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-15', '2026-04-20', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-16 11:58:52', '2026-04-20 10:17:52', '0', '1', '1');
INSERT INTO `plan` VALUES ('94d83943-f98b-4ab2-a876-d6530f85ad74', '关于征集“浙里科普”专家库入库专家及科普资源的通知', '“浙里科普”专家库入库专家要求（满足至少2项以下条件）：①专业资历深厚：具有副高级及以上专业技术职称或同等专业水平，从事相关专业工作5年以上；②科普经验丰富：作为主要成员（前三位）承担过省、厅级科普项目，或获得过省、厅级科普作品创作大赛奖项；具有丰富的科普活动策划、组织或评审经验；③科普成果显著：正式出版过科普著作、译著或科普教材；④组织协调能力强：在科技社团、科研机构、高等院校或相关企业中担任一定管理职务，具有较强的组织协调能力和广泛的业界联系，能够有效推动科普资源的整合与共享。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-02', '2026-04-28', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:34:06', '2026-04-29 09:08:47', '0', '1', '1');
INSERT INTO `plan` VALUES ('9736783a-4eaf-495a-b4da-baeafa9818c8', '本科教育教学审核评估中期整改专业自评', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-27', '2026-05-15', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-27 18:57:10', '2026-04-27 18:57:10', '0', '1', '1');
INSERT INTO `plan` VALUES ('99e6597e-06b4-4f19-b021-8f74e4adf9b1', '11', '111', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-03-28', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '7c7c0103-1f21-4c8e-8056-4584cfa7584e', '111', '常规', '2872cf06-b955-4120-a6c9-03232e4cd01d', '111', '2026-03-27 10:25:02', '2026-03-27 10:25:02', '0', '1', '1');
INSERT INTO `plan` VALUES ('9ced43a8-fdd7-42f1-bcb4-904a57f50b60', '第42次CSP认证考试', '考试时间：2026年5月31日（周日）13:30-17:30\n报名时间：2026年5月4日 9:00-2026年5月24日 23:59', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-04', '2026-05-31', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '4b34307e-d2ce-448a-94d9-8fc7f7763706', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-06 08:20:44', '2026-05-06 08:20:44', '0', '1', '1');
INSERT INTO `plan` VALUES ('9fa04301-44d7-420a-aeb1-29fc967cd67a', '2026届毕业生课程补开教师选配', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-16', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021469', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李魏', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-20 09:40:46', '2026-04-20 09:41:22', '0', '1', '1');
INSERT INTO `plan` VALUES ('a481fb24-3fd2-4b21-a7b4-25eeddfc0729', '高等数学课程调研', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-15', '2026-04-17', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-16 11:59:58', '2026-04-20 10:17:35', '0', '1', '1');
INSERT INTO `plan` VALUES ('a52722c0-0c4f-4628-8e32-3e03897ccfac', '中国高校产学研创新基金-辽沈专项（检验检测）申报指南', '基于大模型的爆破片行业大数据知识治理系统；非接触式传感和监测方式爆破片在线监测平台；面向锅炉设备受热面防腐防磨的智能监测预警系统；基于机器视觉感知的多维度电梯门防夹系统研究等。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-24', '2026-06-22', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-24 15:33:31', '2026-04-24 15:33:31', '0', '1', '1');
INSERT INTO `plan` VALUES ('a7ece4b1-4588-47b1-8d60-bad89b6b8a84', '测试', '测试', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-07', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '20184369', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '谷昊洋', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '测试', '2026-04-30 14:33:54', '2026-04-30 14:35:19', '1', '1', '1');
INSERT INTO `plan` VALUES ('a815332b-8d26-4c01-a461-6145c33b5994', '2025年立项校级教材项目中期检查', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-03-23', '2026-04-13', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-09 11:49:12', '2026-04-13 11:00:34', '0', '1', '1');
INSERT INTO `plan` VALUES ('aaab2315-b6cf-47fc-863c-ef6356782da7', '招生工作', '完成年度招生工作', '0fde0037-edf8-11f0-8623-6018953679ef', '2025-06-01', '2025-06-30', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '程璐', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '完成招生指标', '2026-02-05 20:57:07', '2026-02-11 17:07:46', '1', '1', '1');
INSERT INTO `plan` VALUES ('aaf93f95-83d0-46a8-a6ef-62b6da421cc1', '2026-2027（1）学期教学任务落实', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-20', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋、李魏', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-20 12:00:12', '2026-05-11 14:31:22', '0', '1', '1');
INSERT INTO `plan` VALUES ('b2d09ca1-41e4-4b2c-a238-2a3447368e91', '25号测试', '内容测试。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-25', '2026-03-25', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '谷昊洋', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '任务成功测试', '2026-03-25 11:52:04', '2026-03-25 16:04:14', '1', '1', '0');
INSERT INTO `plan` VALUES ('b3d67510-bc54-4bbc-8690-32019dfdb12d', '111', '11111', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-19', '2026-03-26', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2025002', '29eb867b-f55a-4069-851d-b42322bd5a5d', '111', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-03-19 11:34:58', '2026-03-21 22:26:51', '0', '1', '0');
INSERT INTO `plan` VALUES ('b59a15dd-6a3c-4498-9cc2-720126807f22', '20252学期学生证盖章注册', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-14', '2026-04-17', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20235321', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '隋傅', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-14 09:09:56', '2026-04-17 14:23:23', '0', '1', '1');
INSERT INTO `plan` VALUES ('bca6b9eb-e2a2-4ae3-b75b-89760ca79547', '20252课程教学进度表检查催交', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-07', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021469', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李魏', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-10 11:03:38', '2026-04-13 11:01:45', '0', '1', '1');
INSERT INTO `plan` VALUES ('c12509a7-71f5-43b0-90b1-18bbdfc60865', '本部教师赴基础学部（杭州）授课差旅包干统计', '每月统计一次', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-01', '2026-06-24', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021469', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李魏', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-06 10:01:05', '2026-05-06 10:01:05', '0', '1', '1');
INSERT INTO `plan` VALUES ('c6cd88dc-010c-4c11-8192-5d5d9daa6c06', 'CCF走进高校系列学术报告（尹一通 南京大学 教授；陈翌佳 上海交通大学 教授；唐志皓 上海财经大学 长聘副教授）', '报告时间：2026年4月27日 上午8:30\n报告地点：17幢718会议室', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-27', '2026-04-27', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-24 15:37:43', '2026-04-29 09:08:31', '0', '1', '1');
INSERT INTO `plan` VALUES ('c91555fa-67e0-4c93-81f8-c0047f267b58', '1232', '2214231', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-03-27', '2026-04-15', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '3ee90641-6c9d-453d-9f80-8ec27d58d79b', '李星云', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '3', '2026-03-21 14:30:26', '2026-03-21 14:30:48', '1', '1', '1');
INSERT INTO `plan` VALUES ('cae1c105-70db-497c-aa27-8c04ec2c468a', '电子信息博士点、智能科学与技术博士点申报工作', '材料打磨阶段', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-15', '2026-09-30', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'ad853781-eeb4-44da-9d25-29b1083168c3', '戴情', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-15 10:40:31', '2026-04-15 11:05:53', '1', '1', '1');
INSERT INTO `plan` VALUES ('cb3fd48e-96fd-4524-9b13-38b322e54631', '浙江省科学技术协会关于开展第九批浙江省科普教育基地授牌命名工作的通知', '申报条件：①具有法人资格或受法人正式委托，独立开展科普活动的单位。②愿意承担科普工作责任，主动将科普工作纳入单位发展规划，自主申报科普教育基地。③所开展的业务具有明确的科普内容，充分体现业务类技术的专业要求。重点是能为正常开展科普活动提供专业性保障;为杜绝伪科学、假科普的传播提供健全的防范机制保障;为群众高度参与、公众喜闻乐见的科普活动提供互动性保障。④已经开展科普工作，取得了一定的科普业绩，并在社会上形成了较好的影响力，可持续为公众提供优质科普服务。⑤突出“四个面向”:在内容展示上，突出“科技前沿可视化”在传播手段上，实现“科学传播智能化”:在科普方式上，突出体验式、互动式;在功能定位上，成为“创新生态的助推器”。鼓励我省“315”科技创新体系和“415X”先进制造业集群的前沿科技领域相关单位，国家和省实验室、省技术创新中心、大科学装置、大科学计划、研究院等具有前沿科学启示和普及教育优势的重大科研机构和主要科创平台申报省级科普教育基地。⑥符合《浙江省科普教育基地认定与管理办法》《关于进一步优化科普教育基地业务类技术认定的补充规定》的其他规定。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-10', '2026-04-22', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-13 11:13:16', '2026-04-24 15:32:47', '0', '1', '1');
INSERT INTO `plan` VALUES ('d15bc583-6a5d-4632-b9cc-e4f0f458e553', '电子信息、智能科学与技术博士点申报', '打磨材料', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-15', '2026-04-15', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'ad853781-eeb4-44da-9d25-29b1083168c3', '戴情', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-15 10:47:45', '2026-04-15 11:02:33', '0', '1', '1');
INSERT INTO `plan` VALUES ('d6812c3b-3db8-471a-9a34-3845eb27cbb0', '2026届毕业答辩', '安排并监管毕业答辩过程', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-10', '2026-05-10', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '付慧娟', '58b43f2c-edf7-11f0-8623-6018953679ef', '2872cf06-b955-4120-a6c9-03232e4cd01d', '答辩决议书等材料', '2026-02-05 20:57:07', '2026-02-11 17:07:42', '1', '1', '1');
INSERT INTO `plan` VALUES ('df6e2a3b-b44d-4f90-a687-dd820535e6b0', '关于征集2026年省科协软科学研究课题的通知', '各高校科协限报3项。项目限项并无经费支持，各学院对上报项目进行排序。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-20', '2026-05-25', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-21 08:39:16', '2026-04-21 08:39:16', '0', '1', '1');
INSERT INTO `plan` VALUES ('e17b92d3-215e-4236-90e1-6322a33329d2', '中国高校产学研创新基金-星网锐捷数字教育创新专项申请指南', 'AI赋能高等教育教学研究与实践；高等教育 AI Skills 创新创作研究与实践；人工智能辅助教学评价研究与应用；基于AI的IT基础设施智能运维平台建设与实践等。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-24', '2026-09-15', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-24 15:34:13', '2026-04-24 15:34:13', '0', '1', '1');
INSERT INTO `plan` VALUES ('e331b03d-1cea-4d0d-b6c7-c2e6250e2cfe', '研究生导师招生资格确认', '2026年硕士研究生导师招生资格、2027年博士研究生导师招生资格确认', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-15', '2026-05-17', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '7c7c0103-1f21-4c8e-8056-4584cfa7584e', '高贵芳', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-15 10:59:52', '2026-04-15 11:05:21', '0', '1', '1');
INSERT INTO `plan` VALUES ('e48e5297-4cf7-46cf-88c8-825ffa7ef3bd', '关于做好2025年度科普统计调查工作的通知', '请各相关学院、独立研究机构（单位）安排专人按照本单位情况填报《2025年度科普统计调查表》（word版），具体包括科普人员、科普场地、科普经费、科普传媒、科普活动以及科学教育，共六大类156个指标。指标详解详见2025年度科普统计培训材料。', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-14', '2026-04-28', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-14 14:40:22', '2026-04-29 09:08:41', '0', '1', '1');
INSERT INTO `plan` VALUES ('ea3093f5-bf85-416d-bfe6-5137c487e151', '浙江省知识产权局关于组织申报 2026 年度高价值专利培育项目和平台的通知', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-14', '2026-05-25', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-14 09:06:58', '2026-05-14 09:06:58', '0', '1', '1');
INSERT INTO `plan` VALUES ('edc00c79-58bf-4ac4-b380-c938de2449da', '校教改项目申报', '学院截止：5月15日', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-29', '2026-05-20', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-06 09:38:40', '2026-05-06 09:38:40', '0', '1', '1');
INSERT INTO `plan` VALUES ('f2722256-433c-4bf5-88c6-89c4f1dcc450', '课堂教学质量巡察', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-05-08', '2026-06-24', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-05-08 10:34:14', '2026-05-08 10:34:14', '0', '1', '1');
INSERT INTO `plan` VALUES ('f7ce5e94-d4dd-4797-86b0-6c08b6e03621', '国家级教学成果奖申报打磨', '', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-04-09', '2026-05-31', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '58b43f2c-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 11:41:17', '2026-04-09 11:41:17', '0', '1', '1');
INSERT INTO `plan` VALUES ('fba15032-765e-4b43-ad6f-cf839c8d3406', '2026年新教师公开课听课评课', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-20', '2026-04-30', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '20062862', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', 'c4c19e08-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '', '2026-04-20 11:13:15', '2026-05-08 10:32:52', '0', '1', '1');
INSERT INTO `plan` VALUES ('fc4435cc-47ff-4082-98ab-5f270ee3ca39', '大学生公共服务平台实习数据上报', '', '0fde0037-edf8-11f0-8623-6018953679ef', '2026-04-09', '2026-04-17', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '70021390', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '何煜', 'c4c19e08-edf7-11f0-8623-6018953679ef', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 15:47:43', '2026-04-09 15:47:43', '0', '1', '1');
INSERT INTO `plan` VALUES ('fe9af2be-ad38-4c54-be6b-44731c6a22a9', '2232', '23411', '12bb99bf-edf8-11f0-8623-6018953679ef', '2026-01-01', '2026-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '2025004', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '李星云', '58b43f2c-edf7-11f0-8623-6018953679ef', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '13213321', '2026-03-21 21:18:12', '2026-03-25 16:04:01', '1', '1', '1');

-- ----------------------------
-- Table structure for plan_files
-- ----------------------------
DROP TABLE IF EXISTS `plan_files`;
CREATE TABLE `plan_files`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文件ID',
  `name` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文件名',
  `type` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文件类型',
  `pid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '任务',
  `create_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'yyyy-mm-dd格式',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of plan_files
-- ----------------------------
INSERT INTO `plan_files` VALUES ('26908dab-39c5-407f-9f8d-eb58f2345511', '/resource/f8dd6717-38a3-47bd-b384-bdc74593d88c-1770295785836-20.浙江师范大学研究生课程论文封面.doc', 'achievement', '656850fb-57a8-470f-a017-72f850ab3603', '2026-02-05 20:49:45');
INSERT INTO `plan_files` VALUES ('5527a02f-95fe-40db-9425-43d55e6d1718', '/resource/5f411d93-be53-4d33-9f92-600f007389ca-1769494265863-浙师大技术创新研究院自主研发（设计）项目成本支出申请表(涌欣智能科技)doc.pdf', 'detail', '71030c4b-3dcd-443a-9894-51068981843d', '2026-01-27 14:11:05');
INSERT INTO `plan_files` VALUES ('5f740fdc-4d06-451a-b9fc-87b8a855cb7c', '/resource/14d80d0f-b44f-4891-b9ea-fb6827dfd2d8-1769494276772-浙师大技术创新研究院自主研发（设计）项目成本支出申请表(涌欣智能科技)doc.pdf', 'achievement', '71030c4b-3dcd-443a-9894-51068981843d', '2026-01-27 14:11:16');
INSERT INTO `plan_files` VALUES ('74447936-f65f-4004-968b-22d249b4e587', '/resource/7d515d1c-672f-4222-827f-3828fcecf465-1769486833900-20.浙江师范大学研究生课程论文封面.doc', 'detail', '5a04b0cb-b4cb-49a2-9eea-0c2e59902a16', '2026-01-27 12:07:13');
INSERT INTO `plan_files` VALUES ('758b4698-711d-4da0-b83a-a106a90d72df', '/resource/99e32b3f-1173-4a73-863e-7bc4741fbc5a-1770295850142-20.浙江师范大学研究生课程论文封面.doc', 'detail', '16c12db7-d022-4e2d-8401-4df1725a05af', '2026-02-05 20:50:50');
INSERT INTO `plan_files` VALUES ('b842167e-fe06-43dc-b5e2-41747d09f219', '/resource/05c42af9-953f-4d46-951d-497cfea5cf48-1774425711285-20.浙江师范大学研究生课程论文封面.doc', 'detail', '5c5f2ec3-171f-4d9e-997d-561751575453', '2026-03-25 16:01:51');
INSERT INTO `plan_files` VALUES ('c2d1500c-ff3d-40b8-b8fd-3a560bace8ec', '/resource/task_manage/e2227a9c-2e14-4a82-8309-fe90ff151720-1769417070607-系统测试账号.xls', 'detail', '65ffcb39-7112-42fa-b45b-09169d60b598', '2026-01-26 16:44:30');
INSERT INTO `plan_files` VALUES ('cb28cca3-233b-4efe-9cd6-400f1ece8c46', '/resource/8cb4c18f-921d-4970-8040-04864c9cb6ad-1774410691730-订单1128144714322386-电子普通发票.pdf', 'detail', 'b2d09ca1-41e4-4b2c-a238-2a3447368e91', '2026-03-25 11:51:31');
INSERT INTO `plan_files` VALUES ('cdf76b99-51f8-4d38-b2ab-a9c917893441', '/resource/493ce588-8a83-4b25-bcd3-ff46ef8e9cc6-1770295782893-20.浙江师范大学研究生课程论文封面.doc', 'detail', '656850fb-57a8-470f-a017-72f850ab3603', '2026-02-05 20:49:42');
INSERT INTO `plan_files` VALUES ('cf0f2a44-4076-40d2-a278-1f7890ba7e41', '/resource/ace7dd63-3721-43eb-9b97-98f40f50a580-1770295152550-20.浙江师范大学研究生课程论文封面.doc', 'detail', '408b409a-31e2-499e-b423-7388a0eda37e', '2026-02-05 20:39:12');
INSERT INTO `plan_files` VALUES ('f6a700d0-1089-45a0-8472-7de645819206', '/resource/35277aed-05c9-43b0-94cc-04300af9679a-1769530377142-20.浙江师范大学研究生课程论文封面.doc', 'detail', '25cee0f9-9e21-44da-a5d4-fc9ffa49c01d', '2026-01-28 00:12:57');
INSERT INTO `plan_files` VALUES ('f7faaedc-e277-45d0-8ca0-072a0360706a', '/resource/4e02dbb6-58b9-4202-9a24-f3fb947f83f5-1774410632806-任务数据导入模板.xlsx', 'detail', '4bc8c62f-f544-411d-8edc-9d303f9dfb01', '2026-03-25 11:50:32');
INSERT INTO `plan_files` VALUES ('fe8a9008-5eea-40ba-b74f-939aa067fd5c', '/resource/5334ccaa-f201-4111-88e5-16944d21da7b-1769494272025-附件1：浙江师范大学行知学院外聘兼职教师审批表.docx', 'achievement', '71030c4b-3dcd-443a-9894-51068981843d', '2026-01-27 14:11:12');

-- ----------------------------
-- Table structure for plan_log
-- ----------------------------
DROP TABLE IF EXISTS `plan_log`;
CREATE TABLE `plan_log`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '日志ID',
  `content` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '日志内容',
  `pid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务ID',
  `create_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'yyyy-mm-dd格式',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of plan_log
-- ----------------------------

-- ----------------------------
-- Table structure for role
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色ID',
  `name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色名称',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户id',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of role
-- ----------------------------
INSERT INTO `role` VALUES ('1', '科室人员', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role` VALUES ('2', '科室领导', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role` VALUES ('3', '分管院领导', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role` VALUES ('4', '系统管理员', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role` VALUES ('5', '超级管理员', '8a09e425-f911-11f0-b532-6018953679ef');

-- ----------------------------
-- Table structure for role_permission
-- ----------------------------
DROP TABLE IF EXISTS `role_permission`;
CREATE TABLE `role_permission`  (
  `rid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色ID',
  `pid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '权限ID',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  PRIMARY KEY (`rid`, `pid`, `tid`) USING BTREE,
  INDEX `pid`(`pid`) USING BTREE,
  CONSTRAINT `rp_ibfk_1` FOREIGN KEY (`rid`) REFERENCES `role` (`id`) ON DELETE CASCADE ON UPDATE RESTRICT,
  CONSTRAINT `rp_ibfk_2` FOREIGN KEY (`pid`) REFERENCES `sys_permission` (`id`) ON DELETE CASCADE ON UPDATE RESTRICT
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of role_permission
-- ----------------------------
INSERT INTO `role_permission` VALUES ('1', '09d2b2f4-f8dc-4fa3-ae00-cd7ffe3c9f97', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '09d2b2f4-f8dc-4fa3-ae00-cd7ffe3c9f97', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '09d2b2f4-f8dc-4fa3-ae00-cd7ffe3c9f97', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '09d2b2f4-f8dc-4fa3-ae00-cd7ffe3c9f97', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '124ff8ed-85ed-4f4a-ac90-d47443c4311e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '128139d0-ee81-4cb7-b395-f6e2b9cdf2b3', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '1735640f-ddd9-4de4-a4f3-5375600c88a9', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '1735640f-ddd9-4de4-a4f3-5375600c88a9', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '1735640f-ddd9-4de4-a4f3-5375600c88a9', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '1735640f-ddd9-4de4-a4f3-5375600c88a9', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '1c9ef63a-f2f5-45a0-88b0-07acdc5679a7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '1c9ef63a-f2f5-45a0-88b0-07acdc5679a7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '1c9ef63a-f2f5-45a0-88b0-07acdc5679a7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '1e75ca17-bef4-4b12-b414-84bae0c4b16f', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '2464b4e2-a9f0-4fe3-a77c-94bfdd5a97bb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '2464b4e2-a9f0-4fe3-a77c-94bfdd5a97bb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '2464b4e2-a9f0-4fe3-a77c-94bfdd5a97bb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '24fdf101-cff7-4c04-a7d8-316d60549382', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '24fdf101-cff7-4c04-a7d8-316d60549382', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '24fdf101-cff7-4c04-a7d8-316d60549382', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '24fdf101-cff7-4c04-a7d8-316d60549382', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '2823e267-1061-497a-9dab-57cf8362308e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '2a7e177c-cfa4-4b19-825f-8158bea4bc92', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '2a7e177c-cfa4-4b19-825f-8158bea4bc92', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '2a7e177c-cfa4-4b19-825f-8158bea4bc92', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '2a7e177c-cfa4-4b19-825f-8158bea4bc92', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '2b1ff1ba-728e-4ddc-86cb-6fefae10bc49', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '2b1ff1ba-728e-4ddc-86cb-6fefae10bc49', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '2b1ff1ba-728e-4ddc-86cb-6fefae10bc49', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '31101f7e-2abe-4d9f-a38e-31d78f6274d2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '31101f7e-2abe-4d9f-a38e-31d78f6274d2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '31101f7e-2abe-4d9f-a38e-31d78f6274d2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '31101f7e-2abe-4d9f-a38e-31d78f6274d2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '3a2dc6aa-e9c5-488f-bbee-7d166cb37571', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '3a2dc6aa-e9c5-488f-bbee-7d166cb37571', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '3a2dc6aa-e9c5-488f-bbee-7d166cb37571', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '3b1accae-2a5c-4994-ad83-3dcdc14c3827', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '3dcff433-e560-4ffe-afdb-a8576557da84', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '3dcff433-e560-4ffe-afdb-a8576557da84', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '3dcff433-e560-4ffe-afdb-a8576557da84', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '3f40b1e8-b219-4d32-9332-81cfd35a2b8e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '3f40b1e8-b219-4d32-9332-81cfd35a2b8e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '3f40b1e8-b219-4d32-9332-81cfd35a2b8e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '3fb2bbe3-a583-48d1-a10c-4b4ed8a414ab', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '3fb2bbe3-a583-48d1-a10c-4b4ed8a414ab', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '44c49d5a-5062-4e27-b142-99b9dd787558', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '44c49d5a-5062-4e27-b142-99b9dd787558', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '44c49d5a-5062-4e27-b142-99b9dd787558', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '4973c03b-29b3-437d-91ee-973d1a297481', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '4973c03b-29b3-437d-91ee-973d1a297481', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '4973c03b-29b3-437d-91ee-973d1a297481', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '4c7a4102-a4de-4167-a3f4-16dffce53207', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '4db2c1e6-5d9c-47f4-ad15-76f51e7a619f', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '4db2c1e6-5d9c-47f4-ad15-76f51e7a619f', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '4db2c1e6-5d9c-47f4-ad15-76f51e7a619f', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '4e99b0f2-4007-45bd-aa86-5fc7e5548637', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '4e99b0f2-4007-45bd-aa86-5fc7e5548637', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '4e99b0f2-4007-45bd-aa86-5fc7e5548637', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '4f27b65c-aecb-4c5f-9577-3df29adadacb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '4f27b65c-aecb-4c5f-9577-3df29adadacb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '4f27b65c-aecb-4c5f-9577-3df29adadacb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '4f27b65c-aecb-4c5f-9577-3df29adadacb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '537bc700-1899-4149-8574-e368eeef99df', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '537bc700-1899-4149-8574-e368eeef99df', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '537bc700-1899-4149-8574-e368eeef99df', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '5434f708-5894-4a9f-9635-96cc23bd5ad2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '5434f708-5894-4a9f-9635-96cc23bd5ad2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '5434f708-5894-4a9f-9635-96cc23bd5ad2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '5434f708-5894-4a9f-9635-96cc23bd5ad2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '56041c1d-bfa5-4bc4-9d67-b46da926681e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '56041c1d-bfa5-4bc4-9d67-b46da926681e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '56041c1d-bfa5-4bc4-9d67-b46da926681e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '56041c1d-bfa5-4bc4-9d67-b46da926681e', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '57580828-80bd-42d7-9c01-6c3a8bae1a11', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '59a638d1-d5ca-42ff-8bb0-dd1d3f1cd13c', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '59a638d1-d5ca-42ff-8bb0-dd1d3f1cd13c', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '59a638d1-d5ca-42ff-8bb0-dd1d3f1cd13c', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '635a9339-68fc-4dac-9d8c-ecf38bfcf51a', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '635a9339-68fc-4dac-9d8c-ecf38bfcf51a', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '635a9339-68fc-4dac-9d8c-ecf38bfcf51a', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '635a9339-68fc-4dac-9d8c-ecf38bfcf51a', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '635be8a8-d8d9-40ec-a4da-31b868811067', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '635be8a8-d8d9-40ec-a4da-31b868811067', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '6d603abf-adc2-4abf-a63b-8ee7336c63ec', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '6d603abf-adc2-4abf-a63b-8ee7336c63ec', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '6d603abf-adc2-4abf-a63b-8ee7336c63ec', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '6e4fb262-6d90-460a-8628-8af555709ae1', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '6e4fb262-6d90-460a-8628-8af555709ae1', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '6e4fb262-6d90-460a-8628-8af555709ae1', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '7a88df7c-8f0e-4376-8766-ada4abf4a524', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '7a88df7c-8f0e-4376-8766-ada4abf4a524', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '7a88df7c-8f0e-4376-8766-ada4abf4a524', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '7fe858d1-c62e-48a2-8608-805e4d9bad83', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '7fe858d1-c62e-48a2-8608-805e4d9bad83', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '7fe858d1-c62e-48a2-8608-805e4d9bad83', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '7fe858d1-c62e-48a2-8608-805e4d9bad83', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '8429c422-690d-4d17-9880-d62ddeec054d', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '941d2f45-6e51-427e-93da-150c6623da22', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '941d2f45-6e51-427e-93da-150c6623da22', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '941d2f45-6e51-427e-93da-150c6623da22', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '941d2f45-6e51-427e-93da-150c6623da22', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '99493166-09be-4a83-9550-9c95760525fc', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', '9bad866e-e398-45b4-9cca-12209a81c66c', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '9bad866e-e398-45b4-9cca-12209a81c66c', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '9bad866e-e398-45b4-9cca-12209a81c66c', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '9bad866e-e398-45b4-9cca-12209a81c66c', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', '9e65a5d8-a914-44e7-83f9-fa81b0210a35', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', '9e65a5d8-a914-44e7-83f9-fa81b0210a35', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', '9e65a5d8-a914-44e7-83f9-fa81b0210a35', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'a1835b03-96ab-4e62-83de-7a8edf1c6500', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'a78388af-532d-4878-9bac-340f94e4dcd7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'a78388af-532d-4878-9bac-340f94e4dcd7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'a78388af-532d-4878-9bac-340f94e4dcd7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'a7c8409c-f0bd-4e5e-af8e-2cd48852e8f7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'a8e0175d-9d1b-459a-ab6f-0260a4a36a05', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'a8e0175d-9d1b-459a-ab6f-0260a4a36a05', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'a8e0175d-9d1b-459a-ab6f-0260a4a36a05', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', 'ab6da5ce-9e6b-41e8-af32-bd0e568853b4', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'ab6da5ce-9e6b-41e8-af32-bd0e568853b4', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'ab6da5ce-9e6b-41e8-af32-bd0e568853b4', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'ab6da5ce-9e6b-41e8-af32-bd0e568853b4', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'ab887a71-e8d6-41dd-9aeb-c0b42e8795d7', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'af42c9f8-6d96-4d6e-aece-398185570beb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'af42c9f8-6d96-4d6e-aece-398185570beb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'af42c9f8-6d96-4d6e-aece-398185570beb', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'afb31de6-786c-44b6-addb-2c4f7da4e4f9', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'afb31de6-786c-44b6-addb-2c4f7da4e4f9', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'afb31de6-786c-44b6-addb-2c4f7da4e4f9', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'd5c840e1-7659-4cb3-a7b5-48dc230b0534', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'd5c840e1-7659-4cb3-a7b5-48dc230b0534', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'd5c840e1-7659-4cb3-a7b5-48dc230b0534', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'd9c9b2f9-7972-499e-a5f4-dc96b7ab8c21', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'd9c9b2f9-7972-499e-a5f4-dc96b7ab8c21', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'd9c9b2f9-7972-499e-a5f4-dc96b7ab8c21', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', 'dc3e65c6-c8f6-43d6-b3f0-7053c03ae74b', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'dc3e65c6-c8f6-43d6-b3f0-7053c03ae74b', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'dc3e65c6-c8f6-43d6-b3f0-7053c03ae74b', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'dc3e65c6-c8f6-43d6-b3f0-7053c03ae74b', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'e2813922-d685-4fea-ab00-bb549fe62989', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'e3793db4-4e80-414d-87cb-ebfc19fff2bc', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'e3793db4-4e80-414d-87cb-ebfc19fff2bc', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'e3793db4-4e80-414d-87cb-ebfc19fff2bc', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'e8d9bebb-2891-4979-8e37-7474ddab7ad2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'e8d9bebb-2891-4979-8e37-7474ddab7ad2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'e8d9bebb-2891-4979-8e37-7474ddab7ad2', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', 'e99ae654-ca77-42b6-a677-29c70982ec08', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'e99ae654-ca77-42b6-a677-29c70982ec08', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'e99ae654-ca77-42b6-a677-29c70982ec08', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'e99ae654-ca77-42b6-a677-29c70982ec08', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'ec1d371f-d334-4ba2-8f38-966b6450a387', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'ec1d371f-d334-4ba2-8f38-966b6450a387', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'ec1d371f-d334-4ba2-8f38-966b6450a387', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', 'f6492d01-924e-4310-a069-9057283bfb32', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('2', 'f6492d01-924e-4310-a069-9057283bfb32', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('3', 'f6492d01-924e-4310-a069-9057283bfb32', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'f6492d01-924e-4310-a069-9057283bfb32', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('5', 'f8f06238-bef8-462f-b46e-3850a73f3f6a', '8a09e425-f911-11f0-b532-6018953679ef');
INSERT INTO `role_permission` VALUES ('1', 'f9407086-0443-4634-9f1b-f851872c8949', '8a09e425-f911-11f0-b532-6018953679ef');

-- ----------------------------
-- Table structure for saas
-- ----------------------------
DROP TABLE IF EXISTS `saas`;
CREATE TABLE `saas`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '管理员ID',
  `name` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '管理员昵称',
  `password` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '密码',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '邮箱',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '电话',
  `rid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of saas
-- ----------------------------

-- ----------------------------
-- Table structure for screen_config
-- ----------------------------
DROP TABLE IF EXISTS `screen_config`;
CREATE TABLE `screen_config`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '主键ID',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  `config_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '配置名称（如：大屏首页配置）',
  `config_json` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'JSON格式的大屏参数',
  `is_enabled` tinyint(1) NULL DEFAULT 1 COMMENT '是否启用（1=启用，0=禁用）',
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) COMMENT '创建时间',
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0) COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `idx_tid`(`tid`) USING BTREE,
  INDEX `idx_tid_enabled`(`tid`, `is_enabled`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '大屏参数配置表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of screen_config
-- ----------------------------
INSERT INTO `screen_config` VALUES ('267bffad-35c2-40d0-ab6b-97930ff6abd2', '8a09e425-f911-11f0-b532-6018953679ef', '日期参数', '{\n  \"preDay\": \"10\",\n  \"postDay\": \"15\"\n}', 1, '2026-03-18 18:44:12', '2026-03-18 21:29:38');
INSERT INTO `screen_config` VALUES ('5bfa065f-00d0-409c-8999-6b37cb1bd209', '8a09e425-f911-11f0-b532-6018953679ef', '截至天数', '{\n  \"time\": \"15\"\n}', 1, '2026-03-18 19:48:07', '2026-03-25 20:03:34');

-- ----------------------------
-- Table structure for sys_dict
-- ----------------------------
DROP TABLE IF EXISTS `sys_dict`;
CREATE TABLE `sys_dict`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '字典ID',
  `fid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '父级字典ID',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  `field` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '引用字段',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '引用字段解释',
  `value` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '引用字段内容',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `tid`(`tid`) USING BTREE,
  CONSTRAINT `sys_dict_ibfk_1` FOREIGN KEY (`tid`) REFERENCES `tenant` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_dict
-- ----------------------------
INSERT INTO `sys_dict` VALUES ('004e8f35-68a8-4089-8151-55fc88b3351b', '70bca531-56ad-41d5-a01e-ac2cdc625b06', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '师德师风');
INSERT INTO `sys_dict` VALUES ('00beb639-79af-4999-b1de-318956734974', '00beb639-79af-4999-b1de-318956734974', '8a09e425-f911-11f0-b532-6018953679ef', 'meeting_status', '会议状态', '进行中');
INSERT INTO `sys_dict` VALUES ('0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '753d0eee-08ce-483d-9034-3531b173ea3d', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '科研活动');
INSERT INTO `sys_dict` VALUES ('0fde0037-edf8-11f0-8623-6018953679ef', '0fde0037-edf8-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'attribute', '任务性质', '计划内');
INSERT INTO `sys_dict` VALUES ('10e9a69e-4e6b-4966-837f-df87d541db86', '10e9a69e-4e6b-4966-837f-df87d541db86', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '党建思政');
INSERT INTO `sys_dict` VALUES ('12bb99bf-edf8-11f0-8623-6018953679ef', '12bb99bf-edf8-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'attribute', '任务性质', '计划外');
INSERT INTO `sys_dict` VALUES ('17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '17d8fe16-3ad0-4d36-9db4-319a2ebffffa', '8a09e425-f911-11f0-b532-6018953679ef', 'meeting_status', '会议状态', '未开始');
INSERT INTO `sys_dict` VALUES ('2872cf06-b955-4120-a6c9-03232e4cd01d', '2872cf06-b955-4120-a6c9-03232e4cd01d', '8a09e425-f911-11f0-b532-6018953679ef', 'status', '任务状态', '未开始');
INSERT INTO `sys_dict` VALUES ('2c89ecaf-010f-4a3a-bd31-8b56eb246219', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '8a09e425-f911-11f0-b532-6018953679ef', 'status', '任务状态', '进行中');
INSERT INTO `sys_dict` VALUES ('30ea918d-3a69-47af-a562-504fe6cdcb8a', '753d0eee-08ce-483d-9034-3531b173ea3d', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '项目立项');
INSERT INTO `sys_dict` VALUES ('3ee90641-6c9d-453d-9f80-8ec27d58d79b', '57c5a536-8667-4846-a1c8-24058f87694c', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '对外交流');
INSERT INTO `sys_dict` VALUES ('4b34307e-d2ce-448a-94d9-8fc7f7763706', '753d0eee-08ce-483d-9034-3531b173ea3d', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '社会服务');
INSERT INTO `sys_dict` VALUES ('54e27f4e-d682-4575-a548-517915fa61a1', '54e27f4e-d682-4575-a548-517915fa61a1', '8a09e425-f911-11f0-b532-6018953679ef', 'meeting_status', '会议状态', '已取消');
INSERT INTO `sys_dict` VALUES ('57c5a536-8667-4846-a1c8-24058f87694c', '57c5a536-8667-4846-a1c8-24058f87694c', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '国际合作与社会服务');
INSERT INTO `sys_dict` VALUES ('58b43f2c-edf7-11f0-8623-6018953679ef', '58b43f2c-edf7-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'imp', '重要程度', '重要');
INSERT INTO `sys_dict` VALUES ('5a63ae20-cf49-4b4f-8837-3a5e2f8df47f', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '培养');
INSERT INTO `sys_dict` VALUES ('63c2229c-315f-11f1-999c-6018953679ef', '63c2229c-315f-11f1-999c-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'meeting_status', '会议状态', '已结束');
INSERT INTO `sys_dict` VALUES ('6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '753d0eee-08ce-483d-9034-3531b173ea3d', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '项目申报');
INSERT INTO `sys_dict` VALUES ('70bca531-56ad-41d5-a01e-ac2cdc625b06', '70bca531-56ad-41d5-a01e-ac2cdc625b06', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '师资队伍');
INSERT INTO `sys_dict` VALUES ('753d0eee-08ce-483d-9034-3531b173ea3d', '753d0eee-08ce-483d-9034-3531b173ea3d', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '科学研究');
INSERT INTO `sys_dict` VALUES ('7c7c0103-1f21-4c8e-8056-4584cfa7584e', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '学位');
INSERT INTO `sys_dict` VALUES ('84a082fb-5930-4785-9375-2bdcc8d1bda0', 'eb3d636c-edf7-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '留学生');
INSERT INTO `sys_dict` VALUES ('9d375800-7027-4ce0-af1f-a33199dbb3a9', '9d375800-7027-4ce0-af1f-a33199dbb3a9', '8a09e425-f911-11f0-b532-6018953679ef', 'status', '任务状态', '已撤销');
INSERT INTO `sys_dict` VALUES ('9f80c129-f01c-4927-bb88-2dffdb441e20', '57c5a536-8667-4846-a1c8-24058f87694c', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '双转工作');
INSERT INTO `sys_dict` VALUES ('a757bbbd-b6ac-4be9-ae37-09f1c865b0aa', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '招生');
INSERT INTO `sys_dict` VALUES ('aa1e7031-19c5-4367-84c6-7d4bc144f1d5', 'b652155f-55c1-4fe2-b9b9-0525d55bc944', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '学科建设');
INSERT INTO `sys_dict` VALUES ('ad853781-eeb4-44da-9d25-29b1083168c3', 'b652155f-55c1-4fe2-b9b9-0525d55bc944', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '学位点建设');
INSERT INTO `sys_dict` VALUES ('b62dfc4d-20e6-40c4-aaa9-7b69f56dde49', '70bca531-56ad-41d5-a01e-ac2cdc625b06', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '人才培育');
INSERT INTO `sys_dict` VALUES ('b652155f-55c1-4fe2-b9b9-0525d55bc944', 'b652155f-55c1-4fe2-b9b9-0525d55bc944', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '学科建设类');
INSERT INTO `sys_dict` VALUES ('b7ce9437-e444-4e47-ad67-ac4bf885ccda', '70bca531-56ad-41d5-a01e-ac2cdc625b06', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '人才引进');
INSERT INTO `sys_dict` VALUES ('be585fc0-c0c9-4b1f-81f6-a187e658535b', 'eb3d636c-edf7-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '研究生');
INSERT INTO `sys_dict` VALUES ('c3b61860-6e09-45d5-a9cb-3ce182928ff7', 'eb3d636c-edf7-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '本科生');
INSERT INTO `sys_dict` VALUES ('c4c19e08-edf7-11f0-8623-6018953679ef', 'c4c19e08-edf7-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'imp', '重要程度', '常规');
INSERT INTO `sys_dict` VALUES ('cb4ab833-4566-4261-aa56-f467cf207613', '753d0eee-08ce-483d-9034-3531b173ea3d', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '过程管理');
INSERT INTO `sys_dict` VALUES ('d2f54395-7a48-4f71-bb92-ee00d4a84144', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '8a09e425-f911-11f0-b532-6018953679ef', 'status', '任务状态', '已完成');
INSERT INTO `sys_dict` VALUES ('ded4a8b4-4918-4e35-8d62-e6783a033bbd', '57c5a536-8667-4846-a1c8-24058f87694c', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '合作办学');
INSERT INTO `sys_dict` VALUES ('eb3d636c-edf7-11f0-8623-6018953679ef', 'eb3d636c-edf7-11f0-8623-6018953679ef', '8a09e425-f911-11f0-b532-6018953679ef', 'type', '任务类型', '人才培养');

-- ----------------------------
-- Table structure for sys_permission
-- ----------------------------
DROP TABLE IF EXISTS `sys_permission`;
CREATE TABLE `sys_permission`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '权限ID',
  `parent_id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '父权限ID（顶级权限为NULL）',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '权限名称（如：用户管理）',
  `permission` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '权限标识（如：user:list）',
  `type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '权限类型 1-菜单 2-接口',
  PRIMARY KEY (`id`, `tid`) USING BTREE,
  UNIQUE INDEX `permission_tid`(`permission`, `tid`) USING BTREE,
  INDEX `parent_id`(`parent_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_permission
-- ----------------------------
INSERT INTO `sys_permission` VALUES ('09d2b2f4-f8dc-4fa3-ae00-cd7ffe3c9f97', '4973c03b-29b3-437d-91ee-973d1a297481', '8a09e425-f911-11f0-b532-6018953679ef', '数据导出', 'works:file:export', '2');
INSERT INTO `sys_permission` VALUES ('124ff8ed-85ed-4f4a-ac90-d47443c4311e', '56cd8120-80c3-4788-8dd6-6c26476f86bb', '8a09e425-f911-11f0-b532-6018953679ef', '查看工作（科室领导级）', 'works:operate:get:office', '2');
INSERT INTO `sys_permission` VALUES ('128139d0-ee81-4cb7-b395-f6e2b9cdf2b3', '56cd8120-80c3-4788-8dd6-6c26476f86bb', '8a09e425-f911-11f0-b532-6018953679ef', '查看工作（科室人员级）', 'works:operate:get:ordinary', '2');
INSERT INTO `sys_permission` VALUES ('1735640f-ddd9-4de4-a4f3-5375600c88a9', '1735640f-ddd9-4de4-a4f3-5375600c88a9', '8a09e425-f911-11f0-b532-6018953679ef', '任务总览', 'screen', '1');
INSERT INTO `sys_permission` VALUES ('1c9ef63a-f2f5-45a0-88b0-07acdc5679a7', '56cd8120-80c3-4788-8dd6-6c26476f86bb', '8a09e425-f911-11f0-b532-6018953679ef', '编辑工作', 'works:operate:update', '2');
INSERT INTO `sys_permission` VALUES ('1e75ca17-bef4-4b12-b414-84bae0c4b16f', 'dfd5e4b6-26f6-429c-b257-dcb756205e11', '8a09e425-f911-11f0-b532-6018953679ef', ' 查看任务（科室人员级）', 'plan:operate:get:ordinary', '2');
INSERT INTO `sys_permission` VALUES ('2464b4e2-a9f0-4fe3-a77c-94bfdd5a97bb', '5f4ba90c-2c98-472d-87e7-43d43f045cd2', '8a09e425-f911-11f0-b532-6018953679ef', '重点工作-附件管理', 'works:file', '1');
INSERT INTO `sys_permission` VALUES ('24fdf101-cff7-4c04-a7d8-316d60549382', 'e8d9bebb-2891-4979-8e37-7474ddab7ad2', '8a09e425-f911-11f0-b532-6018953679ef', '今天会议', 'meeting:common:today', '2');
INSERT INTO `sys_permission` VALUES ('2823e267-1061-497a-9dab-57cf8362308e', 'dfd5e4b6-26f6-429c-b257-dcb756205e11', '8a09e425-f911-11f0-b532-6018953679ef', '只读模式', 'plan:operate:readOnly', '2');
INSERT INTO `sys_permission` VALUES ('2a7e177c-cfa4-4b19-825f-8158bea4bc92', '2464b4e2-a9f0-4fe3-a77c-94bfdd5a97bb', '8a09e425-f911-11f0-b532-6018953679ef', '上传附件', 'works:file:upload', '2');
INSERT INTO `sys_permission` VALUES ('2b1ff1ba-728e-4ddc-86cb-6fefae10bc49', '2464b4e2-a9f0-4fe3-a77c-94bfdd5a97bb', '8a09e425-f911-11f0-b532-6018953679ef', '删除附件', 'works:file:delete', '2');
INSERT INTO `sys_permission` VALUES ('31101f7e-2abe-4d9f-a38e-31d78f6274d2', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-重点工作', 'layout:affair:works', '2');
INSERT INTO `sys_permission` VALUES ('3a2dc6aa-e9c5-488f-bbee-7d166cb37571', 'a667c73b-cf52-4b65-ab78-2f1d01ad8b9c', '8a09e425-f911-11f0-b532-6018953679ef', '新增会议', 'meeting:operate:add', '2');
INSERT INTO `sys_permission` VALUES ('3b1accae-2a5c-4994-ad83-3dcdc14c3827', 'dfd5e4b6-26f6-429c-b257-dcb756205e11', '8a09e425-f911-11f0-b532-6018953679ef', '查看任务（科室领导级）', 'plan:operate:get:office', '2');
INSERT INTO `sys_permission` VALUES ('3dcff433-e560-4ffe-afdb-a8576557da84', '537bc700-1899-4149-8574-e368eeef99df', '8a09e425-f911-11f0-b532-6018953679ef', '删除附件', 'plan:file:delete', '2');
INSERT INTO `sys_permission` VALUES ('3f40b1e8-b219-4d32-9332-81cfd35a2b8e', 'afb31de6-786c-44b6-addb-2c4f7da4e4f9', '8a09e425-f911-11f0-b532-6018953679ef', '我的创建', 'plan:common:myCreate', '2');
INSERT INTO `sys_permission` VALUES ('3fb2bbe3-a583-48d1-a10c-4b4ed8a414ab', '56cd8120-80c3-4788-8dd6-6c26476f86bb', '8a09e425-f911-11f0-b532-6018953679ef', '查看工作（分管领导级）', 'works:operate:get:college', '2');
INSERT INTO `sys_permission` VALUES ('44c49d5a-5062-4e27-b142-99b9dd787558', '56cd8120-80c3-4788-8dd6-6c26476f86bb', '8a09e425-f911-11f0-b532-6018953679ef', '删除工作', 'works:operate:delete', '2');
INSERT INTO `sys_permission` VALUES ('4973c03b-29b3-437d-91ee-973d1a297481', '5f4ba90c-2c98-472d-87e7-43d43f045cd2', '8a09e425-f911-11f0-b532-6018953679ef', '重点工作-导入导出', 'works:excel', '1');
INSERT INTO `sys_permission` VALUES ('4c7a4102-a4de-4167-a3f4-16dffce53207', '8429c422-690d-4d17-9880-d62ddeec054d', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-系统数据', 'layout:info:sysData', '2');
INSERT INTO `sys_permission` VALUES ('4db2c1e6-5d9c-47f4-ad15-76f51e7a619f', '9e65a5d8-a914-44e7-83f9-fa81b0210a35', '8a09e425-f911-11f0-b532-6018953679ef', '我的创建', 'works:common:myCreate', '2');
INSERT INTO `sys_permission` VALUES ('4e99b0f2-4007-45bd-aa86-5fc7e5548637', '781f35c4-46c4-4d78-9780-7b1dbabb44ab', '8a09e425-f911-11f0-b532-6018953679ef', '任务列表-导入导出', 'plan:excel', '1');
INSERT INTO `sys_permission` VALUES ('4f27b65c-aecb-4c5f-9577-3df29adadacb', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-任务总览', 'layout:affair:screen', '2');
INSERT INTO `sys_permission` VALUES ('537bc700-1899-4149-8574-e368eeef99df', '781f35c4-46c4-4d78-9780-7b1dbabb44ab', '8a09e425-f911-11f0-b532-6018953679ef', '任务列表-附件管理', 'plan:file', '1');
INSERT INTO `sys_permission` VALUES ('5434f708-5894-4a9f-9635-96cc23bd5ad2', '4e99b0f2-4007-45bd-aa86-5fc7e5548637', '8a09e425-f911-11f0-b532-6018953679ef', '数据导出', 'plan:excel:export', '2');
INSERT INTO `sys_permission` VALUES ('56041c1d-bfa5-4bc4-9d67-b46da926681e', 'e8d9bebb-2891-4979-8e37-7474ddab7ad2', '8a09e425-f911-11f0-b532-6018953679ef', '本周会议', 'meeting:common:week', '2');
INSERT INTO `sys_permission` VALUES ('56cd8120-80c3-4788-8dd6-6c26476f86bb', '5f4ba90c-2c98-472d-87e7-43d43f045cd2', '8a09e425-f911-11f0-b532-6018953679ef', '重点工作-数据操作', 'works:operate', '1');
INSERT INTO `sys_permission` VALUES ('57580828-80bd-42d7-9c01-6c3a8bae1a11', '56cd8120-80c3-4788-8dd6-6c26476f86bb', '8a09e425-f911-11f0-b532-6018953679ef', '只读模式', 'works:operate:readOnly', '2');
INSERT INTO `sys_permission` VALUES ('59a638d1-d5ca-42ff-8bb0-dd1d3f1cd13c', 'dfd5e4b6-26f6-429c-b257-dcb756205e11', '8a09e425-f911-11f0-b532-6018953679ef', '删除任务', 'plan:operate:delete', '2');
INSERT INTO `sys_permission` VALUES ('5f4ba90c-2c98-472d-87e7-43d43f045cd2', '5f4ba90c-2c98-472d-87e7-43d43f045cd2', '8a09e425-f911-11f0-b532-6018953679ef', '重点工作', 'works', '1');
INSERT INTO `sys_permission` VALUES ('635a9339-68fc-4dac-9d8c-ecf38bfcf51a', '537bc700-1899-4149-8574-e368eeef99df', '8a09e425-f911-11f0-b532-6018953679ef', '下载附件', 'plan:file:download', '2');
INSERT INTO `sys_permission` VALUES ('635be8a8-d8d9-40ec-a4da-31b868811067', 'dfd5e4b6-26f6-429c-b257-dcb756205e11', '8a09e425-f911-11f0-b532-6018953679ef', '查看任务（分管领导级）', 'plan:operate:get:college', '2');
INSERT INTO `sys_permission` VALUES ('6d603abf-adc2-4abf-a63b-8ee7336c63ec', 'dfd5e4b6-26f6-429c-b257-dcb756205e11', '8a09e425-f911-11f0-b532-6018953679ef', '新增任务', 'plan:operate:add', '2');
INSERT INTO `sys_permission` VALUES ('6e4fb262-6d90-460a-8628-8af555709ae1', 'e8d9bebb-2891-4979-8e37-7474ddab7ad2', '8a09e425-f911-11f0-b532-6018953679ef', '我的创建', 'meeting:common:myCreate', '2');
INSERT INTO `sys_permission` VALUES ('781f35c4-46c4-4d78-9780-7b1dbabb44ab', '781f35c4-46c4-4d78-9780-7b1dbabb44ab', '8a09e425-f911-11f0-b532-6018953679ef', '任务列表', 'plan', '1');
INSERT INTO `sys_permission` VALUES ('7a88df7c-8f0e-4376-8766-ada4abf4a524', 'a667c73b-cf52-4b65-ab78-2f1d01ad8b9c', '8a09e425-f911-11f0-b532-6018953679ef', '编辑', 'meeting:operate:update', '2');
INSERT INTO `sys_permission` VALUES ('7fe858d1-c62e-48a2-8608-805e4d9bad83', '2464b4e2-a9f0-4fe3-a77c-94bfdd5a97bb', '8a09e425-f911-11f0-b532-6018953679ef', '下载附件', 'works:file:download', '2');
INSERT INTO `sys_permission` VALUES ('8429c422-690d-4d17-9880-d62ddeec054d', 'ab887a71-e8d6-41dd-9aeb-c0b42e8795d7', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-信息管理', 'layout:info', '1');
INSERT INTO `sys_permission` VALUES ('8d04b08b-fb41-4d08-85ae-c00563940c60', '8d04b08b-fb41-4d08-85ae-c00563940c60', '8a09e425-f911-11f0-b532-6018953679ef', '会议安排', 'meeting', '1');
INSERT INTO `sys_permission` VALUES ('941d2f45-6e51-427e-93da-150c6623da22', 'ec1d371f-d334-4ba2-8f38-966b6450a387', '8a09e425-f911-11f0-b532-6018953679ef', '数据导出', 'meeting:excel:export', '2');
INSERT INTO `sys_permission` VALUES ('99493166-09be-4a83-9550-9c95760525fc', '8429c422-690d-4d17-9880-d62ddeec054d', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-模板管理', 'layout:info:template', '2');
INSERT INTO `sys_permission` VALUES ('9bad866e-e398-45b4-9cca-12209a81c66c', 'afb31de6-786c-44b6-addb-2c4f7da4e4f9', '8a09e425-f911-11f0-b532-6018953679ef', '本科室任务', 'plan:common:myOffice', '2');
INSERT INTO `sys_permission` VALUES ('9e65a5d8-a914-44e7-83f9-fa81b0210a35', '5f4ba90c-2c98-472d-87e7-43d43f045cd2', '8a09e425-f911-11f0-b532-6018953679ef', '重点工作-通用功能', 'works:common', '1');
INSERT INTO `sys_permission` VALUES ('a1835b03-96ab-4e62-83de-7a8edf1c6500', '8429c422-690d-4d17-9880-d62ddeec054d', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-权限管理', 'layout:info:authority', '2');
INSERT INTO `sys_permission` VALUES ('a667c73b-cf52-4b65-ab78-2f1d01ad8b9c', '8d04b08b-fb41-4d08-85ae-c00563940c60', '8a09e425-f911-11f0-b532-6018953679ef', '会议安排-数据操作', 'meeting:operate', '1');
INSERT INTO `sys_permission` VALUES ('a78388af-532d-4878-9bac-340f94e4dcd7', '56cd8120-80c3-4788-8dd6-6c26476f86bb', '8a09e425-f911-11f0-b532-6018953679ef', '新增工作', 'works:operate:add', '2');
INSERT INTO `sys_permission` VALUES ('a7c8409c-f0bd-4e5e-af8e-2cd48852e8f7', '8429c422-690d-4d17-9880-d62ddeec054d', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-大屏参数', 'layout:info:screenConfig', '2');
INSERT INTO `sys_permission` VALUES ('a8e0175d-9d1b-459a-ab6f-0260a4a36a05', 'a667c73b-cf52-4b65-ab78-2f1d01ad8b9c', '8a09e425-f911-11f0-b532-6018953679ef', '删除会议', 'meeting:operate:delete', '2');
INSERT INTO `sys_permission` VALUES ('ab6da5ce-9e6b-41e8-af32-bd0e568853b4', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-会议安排', 'layout:affair:meeting', '2');
INSERT INTO `sys_permission` VALUES ('ab887a71-e8d6-41dd-9aeb-c0b42e8795d7', 'ab887a71-e8d6-41dd-9aeb-c0b42e8795d7', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏', 'layout', '1');
INSERT INTO `sys_permission` VALUES ('af42c9f8-6d96-4d6e-aece-398185570beb', '4e99b0f2-4007-45bd-aa86-5fc7e5548637', '8a09e425-f911-11f0-b532-6018953679ef', '数据导入', 'plan:excel:import', '2');
INSERT INTO `sys_permission` VALUES ('afb31de6-786c-44b6-addb-2c4f7da4e4f9', '781f35c4-46c4-4d78-9780-7b1dbabb44ab', '8a09e425-f911-11f0-b532-6018953679ef', '任务列表-通用功能', 'plan:common', '1');
INSERT INTO `sys_permission` VALUES ('c3aa0c1c-5eca-4ac8-9852-e024d2941bae', 'ab887a71-e8d6-41dd-9aeb-c0b42e8795d7', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-任务管理', 'layout:affair', '1');
INSERT INTO `sys_permission` VALUES ('d5c840e1-7659-4cb3-a7b5-48dc230b0534', 'dfd5e4b6-26f6-429c-b257-dcb756205e11', '8a09e425-f911-11f0-b532-6018953679ef', '编辑任务', 'plan:operate:update', '2');
INSERT INTO `sys_permission` VALUES ('d9c9b2f9-7972-499e-a5f4-dc96b7ab8c21', '4973c03b-29b3-437d-91ee-973d1a297481', '8a09e425-f911-11f0-b532-6018953679ef', '数据导入', 'works:file:import', '2');
INSERT INTO `sys_permission` VALUES ('dc3e65c6-c8f6-43d6-b3f0-7053c03ae74b', 'c3aa0c1c-5eca-4ac8-9852-e024d2941bae', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-任务列表', 'layout:affair:plan', '2');
INSERT INTO `sys_permission` VALUES ('dfd5e4b6-26f6-429c-b257-dcb756205e11', '781f35c4-46c4-4d78-9780-7b1dbabb44ab', '8a09e425-f911-11f0-b532-6018953679ef', '任务列表-数据操作', 'plan:operate', '1');
INSERT INTO `sys_permission` VALUES ('e2813922-d685-4fea-ab00-bb549fe62989', '8429c422-690d-4d17-9880-d62ddeec054d', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-用户管理', 'layout:info:user', '2');
INSERT INTO `sys_permission` VALUES ('e3793db4-4e80-414d-87cb-ebfc19fff2bc', 'ec1d371f-d334-4ba2-8f38-966b6450a387', '8a09e425-f911-11f0-b532-6018953679ef', '数据导入', 'meeting:excel:import', '2');
INSERT INTO `sys_permission` VALUES ('e8d9bebb-2891-4979-8e37-7474ddab7ad2', '8d04b08b-fb41-4d08-85ae-c00563940c60', '8a09e425-f911-11f0-b532-6018953679ef', '会议安排-通用功能', 'meeting:common', '1');
INSERT INTO `sys_permission` VALUES ('e99ae654-ca77-42b6-a677-29c70982ec08', '9e65a5d8-a914-44e7-83f9-fa81b0210a35', '8a09e425-f911-11f0-b532-6018953679ef', '本科室工作', 'works:common:myOffice', '2');
INSERT INTO `sys_permission` VALUES ('ec1d371f-d334-4ba2-8f38-966b6450a387', '8d04b08b-fb41-4d08-85ae-c00563940c60', '8a09e425-f911-11f0-b532-6018953679ef', '会议安排-导入导出', 'meeting:excel', '1');
INSERT INTO `sys_permission` VALUES ('f6492d01-924e-4310-a069-9057283bfb32', '537bc700-1899-4149-8574-e368eeef99df', '8a09e425-f911-11f0-b532-6018953679ef', '上传附件', 'plan:file:upload', '2');
INSERT INTO `sys_permission` VALUES ('f8f06238-bef8-462f-b46e-3850a73f3f6a', '8429c422-690d-4d17-9880-d62ddeec054d', '8a09e425-f911-11f0-b532-6018953679ef', '导航栏-科室管理', 'layout:info:office', '2');
INSERT INTO `sys_permission` VALUES ('f9407086-0443-4634-9f1b-f851872c8949', 'a667c73b-cf52-4b65-ab78-2f1d01ad8b9c', '8a09e425-f911-11f0-b532-6018953679ef', '只读模式', 'meeting:operate:readOnly', '2');

-- ----------------------------
-- Table structure for sys_template
-- ----------------------------
DROP TABLE IF EXISTS `sys_template`;
CREATE TABLE `sys_template`  (
  `id` bigint(0) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `tenant_id` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  `original_name` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '模板原始名称（如：任务数据导入模板.xlsx）',
  `storage_name` varchar(256) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '存储文件名（租户ID-原始名称）',
  `file_path` varchar(512) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文件存储绝对路径',
  `create_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) COMMENT '创建时间',
  `update_time` datetime(0) NULL DEFAULT CURRENT_TIMESTAMP(0) ON UPDATE CURRENT_TIMESTAMP(0) COMMENT '更新时间',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_tenant_original`(`tenant_id`, `original_name`) USING BTREE COMMENT '租户+原始名唯一'
) ENGINE = InnoDB AUTO_INCREMENT = 15 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = 'Excel模板管理表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_template
-- ----------------------------
INSERT INTO `sys_template` VALUES (2, '8a09e425-f911-11f0-b532-6018953679ef', '用户数据导入模板.xlsx', '8a09e425-f911-11f0-b532-6018953679ef-用户数据导入模板.xlsx', '/work/task_manage/resource/8a09e425-f911-11f0-b532-6018953679ef-用户数据导入模板.xlsx', '2026-02-05 19:45:01', '2026-02-05 19:45:01');
INSERT INTO `sys_template` VALUES (9, '8a09e425-f911-11f0-b532-6018953679ef', '任务数据导入模板.xlsx', '8a09e425-f911-11f0-b532-6018953679ef-任务数据导入模板.xlsx', '/work/task_manage/resource/8a09e425-f911-11f0-b532-6018953679ef-任务数据导入模板.xlsx', '2026-03-14 21:06:15', '2026-03-14 21:06:15');
INSERT INTO `sys_template` VALUES (10, '8a09e425-f911-11f0-b532-6018953679ef', '工作数据导入模板.xlsx', '8a09e425-f911-11f0-b532-6018953679ef-工作数据导入模板.xlsx', '/work/task_manage/resource/8a09e425-f911-11f0-b532-6018953679ef-工作数据导入模板.xlsx', '2026-03-21 13:00:17', '2026-03-21 13:00:17');
INSERT INTO `sys_template` VALUES (14, '8a09e425-f911-11f0-b532-6018953679ef', '会议数据导入模板.xlsx', '8a09e425-f911-11f0-b532-6018953679ef-会议数据导入模板.xlsx', '/work/task_manage/resource/8a09e425-f911-11f0-b532-6018953679ef-会议数据导入模板.xlsx', '2026-05-14 12:03:22', '2026-05-14 12:03:22');

-- ----------------------------
-- Table structure for tenant
-- ----------------------------
DROP TABLE IF EXISTS `tenant`;
CREATE TABLE `tenant`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户名称',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of tenant
-- ----------------------------
INSERT INTO `tenant` VALUES ('8a09e425-f911-11f0-b532-6018953679ef', '计算机科学与技术学院');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户ID',
  `name` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户名称',
  `password` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户密码',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '租户ID',
  `did` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '科室ID',
  `rid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色ID',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '电话',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '邮箱',
  `status` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户状态',
  `create_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `update_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`, `tid`) USING BTREE,
  INDEX `tid`(`tid`) USING BTREE,
  INDEX `did`(`did`) USING BTREE,
  INDEX `rid`(`rid`) USING BTREE,
  INDEX `id`(`id`) USING BTREE,
  CONSTRAINT `user_ibfk_1` FOREIGN KEY (`tid`) REFERENCES `tenant` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `user_ibfk_2` FOREIGN KEY (`did`) REFERENCES `department` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `user_ibfk_3` FOREIGN KEY (`rid`) REFERENCES `role` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('20022004', '郦炬', '20022004', '8a09e425-f911-11f0-b532-6018953679ef', 'bf43c504-f911-11f0-b532-6018953679ef', '3', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20052604', '郑忠龙', '20052604', '8a09e425-f911-11f0-b532-6018953679ef', 'bf43c504-f911-11f0-b532-6018953679ef', '3', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20062862', '李慧秋', '20062862', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20062864', '潘向', '20062864', '8a09e425-f911-11f0-b532-6018953679ef', 'bf43c504-f911-11f0-b532-6018953679ef', '3', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20093338', '周水红', '20093338', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20184360', '贾日恒', '20184360', '8a09e425-f911-11f0-b532-6018953679ef', 'bf43c504-f911-11f0-b532-6018953679ef', '3', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20184369', '陈慧', '20184369', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20184382', '戴情', '20184382', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20194459', '周昌军', '20194459', '8a09e425-f911-11f0-b532-6018953679ef', 'bf43c504-f911-11f0-b532-6018953679ef', '3', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20204622', '程璐', '20204622', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20235260', '袁壮', '20235260', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20235277', '张利娟', '20235277', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20235321', '隋傅', 'ONLYME123', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '2', '19557911645', '1018468679@qq.com', '正常', '2026-01-27 12:18:59', '2026-04-07 16:04:11');
INSERT INTO `user` VALUES ('20245556', '高贵芳', '20245556', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('2025001', '研办-科室人员', '2025001', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-28 10:24:27');
INSERT INTO `user` VALUES ('2025002', '研办-科室领导', '2025002', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-27 22:49:54');
INSERT INTO `user` VALUES ('2025003', '学工办-科室人员', '2025003', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-27 15:29:03');
INSERT INTO `user` VALUES ('2025004', '学工办-科室领导', '2025004', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-25 11:52:05');
INSERT INTO `user` VALUES ('2025005', '院办-科室人员', '2025005', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-27 15:28:58');
INSERT INTO `user` VALUES ('2025006', '院办-科室领导', '2025006', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-25 11:52:05');
INSERT INTO `user` VALUES ('2025007', '教务办-科室人员', '2025007', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-25 11:52:05');
INSERT INTO `user` VALUES ('2025008', '教务办-科室领导', '2025008', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-25 11:52:05');
INSERT INTO `user` VALUES ('2025009', '领导层-分管领导', '2025009', '8a09e425-f911-11f0-b532-6018953679ef', 'bf43c504-f911-11f0-b532-6018953679ef', '3', '15607074531', '1306561049@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-25 11:52:05');
INSERT INTO `user` VALUES ('20255670', '张芸', '20255670', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20255671', '杨卓', '20255671', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20255678', '楼奕', '20255678', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20255707', '张志琪', '20255707', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('20255766', '王孟斐', '20255766', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('70020056', '项晓玲', '70020056', '8a09e425-f911-11f0-b532-6018953679ef', '1a510726-c06e-4441-b7be-4c7115061b0f', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('70020125', '付慧娟', '70020125', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('70021128', '朱丹华', '70021128', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('70021263', '周敏香', '70021263', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('70021369', '彭景云', '70021369', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', '1', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-01-27 12:18:59');
INSERT INTO `user` VALUES ('70021390', '何煜', '70021390', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-04-07 16:03:37');
INSERT INTO `user` VALUES ('70021424', '谷昊洋', '70021424', '8a09e425-f911-11f0-b532-6018953679ef', 'b61d2b17-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-04-02 09:38:23');
INSERT INTO `user` VALUES ('70021469', '李魏', '70021469', '8a09e425-f911-11f0-b532-6018953679ef', 'ba2213e4-f911-11f0-b532-6018953679ef', '2', '15607074531', '1306561049@qq.com', '正常', '2026-01-27 12:18:59', '2026-04-07 16:03:30');
INSERT INTO `user` VALUES ('admin', '测试用户-超级管理员', '123456', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', '5', '15607074539', '1306561041@qq.com', '正常', '2026-01-25 11:52:05', '2026-01-25 11:52:05');

-- ----------------------------
-- Table structure for works
-- ----------------------------
DROP TABLE IF EXISTS `works`;
CREATE TABLE `works`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作ID',
  `name` varchar(80) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作名称',
  `detail` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作详情',
  `start_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '开始时间',
  `end_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '结束时间',
  `tid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学院ID',
  `did` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '科室ID',
  `uid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '申报人ID',
  `type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作类型sys_dic.name',
  `head` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '负责人',
  `status` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '工作状态sys_dic.name',
  `achievement` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '工作成果',
  `create_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'yyyy-MM-dd HH:mm:ss 格式\r\n',
  `update_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'yyyy-MM-dd HH:mm:ss 格式',
  `isdelete` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '逻辑删除',
  `isopen` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '可见范围',
  `isshow` varchar(6) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '是否展示到驾驶舱',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `uid`(`uid`) USING BTREE,
  INDEX `type_id`(`type`) USING BTREE,
  CONSTRAINT `works_ibfk_1` FOREIGN KEY (`uid`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of works
-- ----------------------------
INSERT INTO `works` VALUES ('1e0b14c4-9e71-4473-8b7e-3dc4b31b353e', '理工科科研工作例会', '3月26日（周四）下午2：30，行政北楼202会议室，请各理工科学院分管科研副院长及科研秘书参加。', '2026-03-23', '2026-03-26', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', '2872cf06-b955-4120-a6c9-03232e4cd01d', '', '2026-03-25 14:31:24', '2026-03-25 14:34:59', '1', '1', '1');
INSERT INTO `works` VALUES ('39ad02eb-96dc-4e33-bce6-a235a0e1b19e', '2026年博士招生', '4月25日进行英语水平测试，我院有6位考生参加；4月30日前完成博士考生材料打分；5月上旬--中旬博士考生面试', '2026-03-20', '2026-05-31', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'a757bbbd-b6ac-4be9-ae37-09f1c865b0aa', '戴情', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-15 10:40:59', '2026-04-15 10:43:47', '1', '1', '1');
INSERT INTO `works` VALUES ('3be64005-c681-4933-92c1-afcad0595a8b', '资助工作', '资助对象认定及助学金发放', '2025-01-01', '2025-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'be585fc0-c0c9-4b1f-81f6-a187e658535b', '张芸', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '资助认定、资助审核', '2026-03-14 21:07:12', '2026-03-25 14:42:04', '0', '1', '1');
INSERT INTO `works` VALUES ('3d088763-87c6-428f-8df4-42f5c09708ca', '明智讲堂系列学术报告（滕尚华 南加州大学 教授）', '报告题目：Understanding and Characterizing Regularization\n报告人：滕尚华\n报告时间：2026年3月27日 上午10:00\n报告地点：20幢1楼报告厅', '2026-03-27', '2026-03-27', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', '2872cf06-b955-4120-a6c9-03232e4cd01d', '', '2026-03-25 14:32:57', '2026-03-25 14:35:01', '1', '1', '1');
INSERT INTO `works` VALUES ('4bb0dedb-1138-4b64-91f9-945ae2baafad', '测试', '', '2026-04-16', '2026-04-16', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '测试', '2872cf06-b955-4120-a6c9-03232e4cd01d', '', '2026-04-16 09:38:05', '2026-05-05 20:47:36', '1', '1', '1');
INSERT INTO `works` VALUES ('54e0c1de-5f04-485d-a239-c1f73516f9ca', '党员发展', '按年度完成党员发展指标', '2025-01-01', '2025-12-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '张利娟', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '党员发展材料', '2026-03-14 21:07:12', '2026-03-14 21:07:12', '0', '1', '1');
INSERT INTO `works` VALUES ('575cebc6-fe89-475f-aee2-2a7fc9598f3d', '就业工作', '联系学生推荐岗位，录入就业材料', '2025-09-01', '2028-02-05', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '杨卓、楼奕', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '就业率', '2026-03-14 21:07:11', '2026-03-14 21:07:11', '0', '1', '1');
INSERT INTO `works` VALUES ('5a25df16-9e02-47c1-b570-150c1dbed102', '2026届毕业答辩', '安排并监管毕业答辩过程', '2026-05-10', '2026-05-10', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', 'eb3d636c-edf7-11f0-8623-6018953679ef', '付慧娟', '2872cf06-b955-4120-a6c9-03232e4cd01d', '答辩决议书等材料', '2026-03-14 21:07:11', '2026-04-17 09:12:26', '1', '1', '1');
INSERT INTO `works` VALUES ('712e3492-5c11-4a5f-a731-e7fde1495cd1', '国家级教学成果奖申报', '', '2026-03-01', '2026-05-31', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '李慧秋', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-09 15:41:15', '2026-04-09 15:41:43', '1', '1', '1');
INSERT INTO `works` VALUES ('83c6ec9c-0026-40fd-bf93-6d10fa1250f0', '关于组织申报2026年度高等教育研究课题暨“人工智能赋能教育教学应用研究”专项课题立项申报工作的通知', '（1）2026年度高等教育研究课题申报办法：我校限报5项。\n（2）“人工智能赋能教育教学应用研究”专项课题申报办法：我校限报2项。', '2026-03-17', '2026-04-20', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', '6a0c0e54-5b2e-45e2-9c27-6c6054acccd2', '周敏香', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '申报课题', '2026-03-25 14:25:52', '2026-03-25 14:34:53', '1', '1', '1');
INSERT INTO `works` VALUES ('b31d02bc-7766-4c5d-8f89-0c34efeaf3a8', '测试', '测试', '2026-05-05', '2026-05-05', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '张志琪', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试', '2026-05-05 20:46:51', '2026-05-05 20:49:28', '1', '1', '1');
INSERT INTO `works` VALUES ('b5ba1d97-6288-42a2-b336-5b38cb68d674', '学科竞赛', '打磨竞赛项目', '2026-03-25', '2026-03-31', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '张志琪', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '竞赛奖项', '2026-03-14 21:07:12', '2026-03-25 09:08:37', '0', '1', '1');
INSERT INTO `works` VALUES ('bd8b3edd-326f-4ab9-b4ff-cc606db53201', '评优评奖', '计算各类数据，评比荣誉称号', '2025-07-01', '2025-11-30', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '袁壮、楼奕', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '奖项公示', '2026-03-14 21:07:12', '2026-03-25 09:05:15', '0', '1', '1');
INSERT INTO `works` VALUES ('c5e72827-e2da-4b69-a138-fe9ba64b5983', '测试2', '测试2', '2026-05-05', '2026-05-05', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '周敏香', '2872cf06-b955-4120-a6c9-03232e4cd01d', '测试2', '2026-05-05 20:49:23', '2026-05-05 21:13:16', '1', '1', '1');
INSERT INTO `works` VALUES ('eb33c230-faf6-461e-85ae-98b60e21fb03', '浙江省科学技术厅 浙江省教育厅关于组织开展2026年浙江省“科技副总”选聘工作的通知', '1.关于续聘：已参与2025年选聘且协议期限为2025年至2027年的科技副总，如与企业合作良好并有意继续合作的，请重新签订并上传《科技副总三方协议》。新协议期限自2026年起，可根据实际合作情况签订2年及以上。\n2.关于更换派驻企业：2025年科技副总协议仍在有效期内的，须先解除原协议，方可派驻至新企业担任科技副总。\n3.关于兼聘：已参与市级科技副总选聘的，可同时参与省级科技副总选聘。', '2026-04-22', '2026-05-20', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '0e569ae5-c429-4967-a0f6-4ddaafaaeb3e', '周敏香', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '', '2026-04-22 10:46:23', '2026-05-06 09:51:41', '0', '1', '1');
INSERT INTO `works` VALUES ('ef117bf0-af33-4f6b-bc81-7a4b12e294d4', '2026届学位论文盲审', '安排并监管过程', '2026-03-15', '2026-05-01', '8a09e425-f911-11f0-b532-6018953679ef', 'addeec73-f911-11f0-b532-6018953679ef', 'admin', '7c7c0103-1f21-4c8e-8056-4584cfa7584e', '付慧娟', '2c89ecaf-010f-4a3a-bd31-8b56eb246219', '盲审评阅书', '2026-03-14 21:07:11', '2026-04-17 09:12:52', '0', '1', '1');
INSERT INTO `works` VALUES ('f88e8bca-7769-4ab1-b95d-c0cf651da28d', '招生工作', '完成年度招生工作', '2025-06-01', '2025-06-30', '8a09e425-f911-11f0-b532-6018953679ef', 'b23da0d1-f911-11f0-b532-6018953679ef', 'admin', '8c71f908-e82b-4241-83e3-5bdd9048fa44', '程璐', 'd2f54395-7a48-4f71-bb92-ee00d4a84144', '完成招生指标', '2026-03-14 21:07:12', '2026-03-14 21:09:35', '0', '1', '1');
INSERT INTO `works` VALUES ('fea44107-39bb-46a7-9f0e-b70775b54005', '测试', '', '2026-04-16', '2026-04-16', '8a09e425-f911-11f0-b532-6018953679ef', '1d3271a4-f27b-4d35-8f2e-a69f6856218b', 'admin', 'c3b61860-6e09-45d5-a9cb-3ce182928ff7', '测试', '2872cf06-b955-4120-a6c9-03232e4cd01d', '', '2026-04-16 09:37:16', '2026-04-16 09:37:35', '1', '1', '1');

-- ----------------------------
-- Table structure for works_files
-- ----------------------------
DROP TABLE IF EXISTS `works_files`;
CREATE TABLE `works_files`  (
  `id` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文件ID',
  `name` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文件名',
  `type` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文件类型',
  `pid` varchar(36) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '任务',
  `create_time` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'yyyy-mm-dd格式',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of works_files
-- ----------------------------

SET FOREIGN_KEY_CHECKS = 1;
